[
  {
    "cardId": "mi_023",
    "cardType": "flippable",
    "sideA": "¿Que tipo de cuenta has usado para obtener ese problema?",
    "sideB": [
      "What kind of account did you use to get that issue?",
      "Which account type did you use when you ran into this bug?",
      "What were the account details you used to reproduce the problem?",
      "What kind of account have you used to get that issue?"
    ],
    "note": "English questions with 'what' require an auxiliary verb like [did] before the subject: [did you use...?], not you used...?.\n\n~Obtain a problem~ is too formal and literal. In the context of bugs, you [get], [find], or [run into] them."
  },
  {
    "cardId": "mi_024",
    "cardType": "flippable",
    "sideA": "¿Podrias compartir la cuenta que has usado para poder replicar el problema?",
    "sideB": [
      "Could you share the account you used so I can replicate the issue?",
      "Can you send me the credentials for the account you used? I need them to reproduce the bug.",
      "Would you be able to provide the account info? I'd like to try and replicate the issue on my end.",
      "Could you share the account you've used so I can replicate the issue?"
    ],
    "note": "The correct structure is [share something WITH someone]. Share me the account is incorrect.\n\nTo express purpose, use the structure [to replicate] or [so I can replicate], not for can replicate."
  },
  {
    "cardId": "mi_035",
    "cardType": "flippable",
    "sideA": "Les voy a compartir el enlace en el chat.",
    "sideB": [
      "I'm sharing the link in the chat now.",
      "I'll drop the link in the chat for you all.",
      "The link is going into the chat.",
      "I'm going to share the link in the chat."
    ],
    "note": "The structure is [share something WITH someone]. I'm going to share you the link is incorrect.\n\n'Compartir' does not translate to part in this context. The correct verb is [to share].\n\nBoth [I'm sharing...] (Present Continuous) and [I'm going to share...] are excellent for expressing an immediate future action in this context."
  },
  {
    "cardId": "mi_004",
    "cardType": "flippable",
    "sideA": "Sí vendra a la reunion, esta en camino.",
    "sideB": [
      "Yes, he's coming to the meeting. He's on his way.",
      "Yep, he'll be here. He's on his way.",
      "He'll be at the meeting. He's on his way.",
      "He'll join the meeting. He's on his way."
    ],
    "note": "The correct idiom for traveling towards a destination is [on the way]. The phrase in the way means something is an obstacle.\n\nThe verb [join] does not need the preposition to. The correct form is [join the meeting], not join to the meeting."
  },
  {
    "cardId": "mi_025",
    "cardType": "flippable",
    "sideA": "Usando mis cuentas no he podido obtener ese problema.",
    "sideB": [
      "I haven't been able to replicate the issue using my accounts.",
      "I couldn't reproduce that bug with my test accounts.",
      "I tried with my accounts, but I couldn't get the problem to occur.",
      "Using my accounts, I haven't been able to get the issue."
    ],
    "note": "The present perfect [haven't] must be followed by a past participle, like [been able to], not a modal verb like can.\n\nThe negative form of 'could' is [could not] or [couldn't], not not could. Also, obtain the problem is unnatural; use [get the issue]."
  },
  {
    "cardId": "mi_007",
    "cardType": "flippable",
    "sideA": "No podre asistir a la reunion de más tarde.",
    "sideB": [
      "I won't be able to join the meeting later.",
      "I can't make it to the meeting later on.",
      "I won't be able to be there for the meeting later.",
      "I can't join the meeting later."
    ],
    "note": "Negatives are formed with [not] (e.g., [I cannot] or [I can't]), not I no can.\n\n~More late~ is grammatically incorrect; use [later]."
  },
  {
    "cardId": "mi_017",
    "cardType": "flippable",
    "sideA": "No entendi muy bien el problema, puedes repetirlo?",
    "sideB": [
      "I didn't quite get the issue. Could you repeat that?",
      "Sorry, I missed that. Can you go over the problem again?",
      "I'm a bit lost, could you run that by me one more time?",
      "I didn't understand that very well. Could you repeat it?"
    ],
    "note": "The negative past tense requires [did not] or [didn't], not I not understood. Correct: [I didn't understand].\n\n~Good~ is an adjective. The correct adverb to modify a verb like 'understand' is [well]. Correct: [I didn't understand it well]."
  },
  {
    "cardId": "mi_034",
    "cardType": "flippable",
    "sideA": "¿Alguna otra pregunta antes de terminar?",
    "sideB": [
      "Any other questions before we wrap up?",
      "Does anyone have anything else before we go?",
      "Are there any final questions?",
      "Any other questions before finishing?"
    ],
    "note": "'Question' should usually be plural ([questions]). After 'before', use the -ing form of the verb: [before finishing], not before to finish.\n\n~More questions~ sounds abrupt. Using [Any other questions] or [Any final questions] is more natural and polite."
  },
  {
    "cardId": "mi_001",
    "cardType": "flippable",
    "sideA": "El no va a venir a la reunion, tenia cosas personales que hacer.",
    "sideB": [
      "He's not going to make it to the meeting. He had some personal stuff to take care of.",
      "He won't be able to join today. He had a personal matter to attend to.",
      "He's going to miss the meeting; he had something personal come up.",
      "He won't join the meeting; he had to take care of a personal matter."
    ],
    "note": "Phrasal verbs like [to make it to] (attend) and [to take care of] (deal with) are common.\n\n~things to make~ is incorrect; the verb make is for creating. For tasks, use [do] or [take care of].\n\n~To assist~ is a false friend meaning 'to help'. The correct verb is [to attend]."
  },
  {
    "cardId": "mi_032",
    "cardType": "flippable",
    "sideA": "Entonces, para resumir...",
    "sideB": [
      "So, to recap...",
      "Alright, just to summarize the key points...",
      "Let me quickly go over what we've decided."
    ],
    "note": "Resume is a verb ('to start again') or a noun (a CV). The verb for 'resumir' is [to summarize] or [to recap].\n\n~To make a summary~ is grammatically okay but clunky. Using the verbs [to summarize] or [to recap] is more direct and natural.\n\n~So, to summary...~ (Incorrect: 'summary' is a noun. The infinitive verb form is required here, which is 'to summarize'.)"
  },
  {
    "cardId": "mi_028",
    "cardType": "flippable",
    "sideA": "Se te escucha un poco entrecortado.",
    "sideB": [
      "You're breaking up a little bit.",
      "Your audio is a little choppy.",
      "We're losing you, your connection seems unstable.",
      "It sounds like you're breaking up a bit."
    ],
    "note": "The literal translation You listen cut is incorrect. The correct idiom is [You're breaking up] or [Your audio is choppy].\n\nThe impersonal 'se' in Spanish doesn't translate to one here. The focus should be on [you] (the person speaking) or [your audio]."
  },
  {
    "cardId": "mi_027",
    "cardType": "flippable",
    "sideA": "¿Qué opinan sobre esto?",
    "sideB": [
      "What are your thoughts on this?",
      "What do you guys think about this?",
      "Any feedback on this part?",
      "What's your opinion about this?"
    ],
    "note": "Questions with 'what' require the auxiliary verb [do] before the subject: [What do you think...?], not What you think?.\n\n~How~ asks about the manner/method. [What] asks for the opinion itself. To ask for an opinion, use [What do you think?]."
  },
  {
    "cardId": "mi_005",
    "cardType": "flippable",
    "sideA": "Sí, yo voy a venir a la reunion que hay más tarde.",
    "sideB": [
      "Yes, I'll be at the meeting later on.",
      "Yep, I'm going to join the meeting later.",
      "I'll make it to the meeting later.",
      "Yes, I'm coming to the meeting later.",
      "Yes, I'll join the meeting later."
    ],
    "note": "The phrase 'que hay más tarde' is naturally expressed as just [later] or [later on], not the literal that there is later.\n\nUse [attend] or [join], not assist. Also, more late is incorrect; the correct adverb is [later].\n\n~I'll come the meeting~ (Incorrect: The verb 'come' requires the preposition 'to' when followed by a destination. Correct: 'come TO the meeting'.)"
  },
  {
    "cardId": "mi_013",
    "cardType": "flippable",
    "sideA": "Me queda bastante claro el problema.",
    "sideB": [
      "The issue is pretty clear to me now.",
      "Yeah, I have a clear understanding of the issue.",
      "I understand the problem clearly now.",
      "It's clear to me."
    ],
    "note": "The literal translation The problem stays clear to me is unnatural. English uses [The problem is clear to me] or [I understand].\n\nStarting with For me... (For me the problem is very clear) is less natural than starting with the subject ([The problem is...]) or the person ([I understand...])."
  },
  {
    "cardId": "mi_002",
    "cardType": "flippable",
    "sideA": "La verdad no se si el vaya a venir a la reunion.",
    "sideB": [
      "To be honest, I'm not sure if he's going to join the meeting.",
      "I actually don't know if he'll make it to the meeting.",
      "Honestly, I'm not sure if he'll be there.",
      "To be honest, I don't know if he's coming to the meeting."
    ],
    "note": "'La verdad' translates idiomatically to [To be honest] or [Honestly], not the literal The true.\n\nAfter 'if', you need a proper future tense, such as [if he will go] or [if he is going to go], not if he go."
  },
  {
    "cardId": "mi_016",
    "cardType": "flippable",
    "sideA": "No me ha quedado del todo claro el problema, podrias refrasearlo porfavor.",
    "sideB": [
      "I'm not sure I fully understand the issue. Could you please rephrase it?",
      "The issue isn't totally clear to me yet. Can you explain it in a different way?",
      "I don't think I quite follow. Could you word that differently, please?",
      "I didn't understand the problem very well, can you rephrase it?"
    ],
    "note": "The literal translation The problem has not stayed clear for me is unnatural. Focus on the person: [I don't understand] or [It isn't clear to me].\n\nThe single verb for 'decir con otras palabras' is [to rephrase]. The request [Could you rephrase it?] is natural and polite."
  },
  {
    "cardId": "mi_008",
    "cardType": "flippable",
    "sideA": "El no podra asistir a la reunion de mañana.",
    "sideB": [
      "He won't be able to attend tomorrow's meeting.",
      "He can't make it to the meeting tomorrow.",
      "He isn't going to be at the meeting tomorrow.",
      "He won't be able to join the meeting tomorrow."
    ],
    "note": "A double modal verb phrase like will can is incorrect. Use [will be able to].\n\n~Assist~ is a false friend; it means 'to help'. The correct verb is [attend]."
  },
  {
    "cardId": "mi_011",
    "cardType": "flippable",
    "sideA": "Si podre unirme a la reunion el viernes.",
    "sideB": [
      "Yes, I'll be able to join the meeting on Friday.",
      "Yep, I can make it to the meeting on Friday.",
      "Yes, I'm available for the meeting on Friday.",
      "Yes, I can join the meeting on Friday."
    ],
    "note": "The Spanish 'Si' (no accent) means 'if', but 'Sí' (with accent) means 'yes'. Don't confuse If I can join... with [Yes, I can join...].\n\nWe don't use the before days of the week in this context; it's [on Friday]."
  },
  {
    "cardId": "mi_022",
    "cardType": "flippable",
    "sideA": "El fix del problema sera entregado en el proximo release.",
    "sideB": [
      "The fix for this issue will be delivered in the next release.",
      "The fix is scheduled for the next release.",
      "The solution for this problem will be included in the upcoming release."
    ],
    "note": "After [will be], you need the past participle for the passive voice. Delivery is a noun; [delivered] is the correct verb form.\n\nWhile given isn't strictly wrong, [delivered] or [included] are more professional terms in a software context.\n\n~The fix of this issue will be delivered for the next release.~ (Slightly unnatural: Use the preposition 'for' to link a solution to a problem, e.g., 'fix FOR this issue'. Use 'in' to specify when something is included within a release, e.g., 'delivered IN the next release'.)\n\n ~The fix of this issue~, suena un poco raro y no es la forma estándar. La opción correcta y mucho más común es [The fix for this issue]. \nUsamos of más para indicar posesión, \nUsamos for para indicar el propósito de algo."
  },
  {
    "cardId": "mi_006",
    "cardType": "flippable",
    "sideA": "No podre asistir a la reunion de mañana.",
    "sideB": [
      "I won't be able to make it to tomorrow's meeting.",
      "I can't attend the meeting tomorrow.",
      "Unfortunately, I won't be able to attend the meeting tomorrow.",
      "I won't be able to join the meeting tomorrow."
    ],
    "note": "The modal verb can does not have a future form; I will not can is incorrect. You must use the structure [will be able to].\n\n~Assist~ is a false friend for 'asistir'; use [attend]. The possessive form [tomorrow's meeting] is more natural than the meeting of tomorrow."
  },
  {
    "cardId": "mi_030",
    "cardType": "flippable",
    "sideA": "Sí, me parece una buena idea.",
    "sideB": [
      "Yeah, that sounds like a good idea.",
      "I agree, that makes sense.",
      "That's a great approach, I'm on board.",
      "It seems like a good idea."
    ],
    "note": "The verb seem doesn't use the structure it seems me. Correct forms are [It seems like a good idea TO ME] or, more naturally, [That sounds like a good idea].\n\n[Agree] is a verb, not an adjective. You don't say I am agree. The correct form is [I agree].\n\n~It seems a good idea to me~ (Slightly unnatural: It's more common and idiomatic to include 'like', e.g., 'It seems LIKE a good idea to me'. The phrase 'That sounds like a good idea' is even more common.)"
  }
]