[
  {
    "cardId": "tech_convo_020",
    "sideA": {
      "conversation": [
        {
          "text": "What are the action items from this meeting?",
          "audioSrc": "public/data/audio/tech_convos/tech_convo_020_a.mp3"
        },
        {
          "text": "John will investigate the database performance, and I will draft the project proposal.",
          "audioSrc": "public/data/audio/tech_convos/tech_convo_020_b.mp3"
        }
      ]
    },
    "note": "'Action items' are specific, defined tasks assigned to one or more people, to be completed after a meeting. They are the concrete outcomes of a discussion.\n\nTo 'draft' something means to prepare a preliminary version of a document, like a plan or proposal, that will be reviewed and revised later."
  },
  {
    "cardId": "tech_convo_033",
    "sideA": {
      "conversation": [
        {
          "text": "Does anyone have anything to add to the agenda?",
          "audioSrc": "public/data/audio/tech_convos/tech_convo_033_a.mp3"
        },
        {
          "text": "Yes, I'd like to briefly discuss the feedback from the UX team.",
          "audioSrc": "public/data/audio/tech_convos/tech_convo_033_b.mp3"
        }
      ]
    },
    "note": "'Briefly' means for a short duration; it's used here to indicate the discussion won't take much time, showing respect for the meeting's schedule.\n\n'UX' stands for User Experience, which refers to the overall experience and satisfaction a person has when using a product."
  },
  {
    "cardId": "tech_convo_068",
    "sideA": {
      "conversation": [
        {
          "text": "Let's take this discussion offline, it's too in-depth for this meeting.",
          "audioSrc": "public/data/audio/tech_convos/tech_convo_068_a.mp3"
        },
        {
          "text": "Good idea. I'll set up a follow-up with the relevant stakeholders.",
          "audioSrc": "public/data/audio/tech_convos/tech_convo_068_b.mp3"
        }
      ]
    },
    "note": "To 'take something offline' means to discuss it outside of the current meeting.\n\n'Stakeholders' are people who have an interest or concern in the project.\n\nA 'follow-up' is a subsequent action, meeting, or communication to continue a previous discussion or to check on progress."
  },
  {
    "cardId": "tech_convo_010",
    "sideA": {
      "conversation": [
        {
          "text": "The build failed in the CI/CD pipeline.",
          "audioSrc": "public/data/audio/tech_convos/tech_convo_010_a.mp3"
        },
        {
          "text": "It seems like a dependency issue. Let me investigate.",
          "audioSrc": "public/data/audio/tech_convos/tech_convo_010_b.mp3"
        }
      ]
    },
    "note": "A 'pipeline' in software development refers to a series of automated stages that code passes through, from being written to being deployed. The 'CI/CD pipeline' specifically automates the build, test, and deployment process.\n\nA 'dependency' is an external software component that a project relies on to work."
  }
]