[
  {
    "cardId": "itc_095",
    "cardType": "flippable",
    "sideA": {
      "text": "Arrastra el icono que está a la izquierda hacia la papelera.",
      "visualContent": {
        "type": "ascii",
        "value": "Icon ⬅ 🗑"
      }
    },
    "sideB": [
      "Drag the icon on the left over to the trash.",
      "Go ahead and drag the leftmost icon to the trash can.",
      "Please drag the icon on the left and drop it in the trash.",
      "Drag the item on the left to the right."
    ],
    "note": "**Vocabulary Note:** In computing, 'trash' and 'trash can' (or 'Recycle Bin' in Windows) are often used interchangeably to refer to the temporary storage for deleted files."
  },
  {
    "cardId": "itc_075",
    "cardType": "flippable",
    "sideA": {
      "text": "Fíjate en la barra de estado de abajo, ¿qué mensaje te aparece?",
      "visualContent": {
        "type": "icon",
        "value": "fas fa-info-circle"
      }
    },
    "sideB": [
      "Check the status bar at the bottom, what message does it show?",
      "Take a look at the status bar down below, what does it say?",
      "Can you tell me what the message is in the status bar at the bottom?",
      "Check the status bar on the bottom, what message does it show?"
    ],
    "note": "**Preposition Note:** Both 'at the bottom' and 'on the bottom' are correct and commonly used when referring to a position on a screen or page."
  },
  {
    "cardId": "itc_091",
    "cardType": "flippable",
    "sideA": {
      "text": "Selecciona todo el texto del medio de la pantalla.",
      "visualContent": {
        "type": "icon",
        "value": "fas fa-align-center"
      }
    },
    "sideB": [
      "Select all the text in the middle of the screen.",
      "Go ahead and highlight the text in the center of the screen.",
      "Can you select that block of text in the middle?",
      "Select all the text in the middle of the view.",
      "Select all the text on the middle of the screen."
    ],
    "note": "**Usage Note:** While 'on the middle' is sometimes used, 'in the middle' or 'in the center' are the most common and standard prepositions when referring to a location within an area like a screen."
  },
  {
    "cardId": "itc_049",
    "cardType": "flippable",
    "sideA": {
      "text": "Necesito que aceptes la solicitud para compartir pantalla.",
      "visualContent": {
        "type": "icon",
        "value": "fas fa-user-plus"
      }
    },
    "sideB": [
      "I need you to accept the screen share request.",
      "Please accept the prompt to share your screen.",
      "A request to share your screen should have popped up, please accept it.",
      "I need you to accept the request to share the screen."
    ],
    "note": "**Grammar Note:** Both 'screen share request' (using a compound noun) and 'request to share the screen' are grammatically correct and mean the same thing. The first is slightly more concise."
  },
  {
    "cardId": "itc_107",
    "cardType": "flippable",
    "sideA": {
      "text": "Arrastra lo que está abajo a la izquierda, hacia arriba.",
      "visualContent": {
        "type": "ascii",
        "value": "↙ ⬆"
      }
    },
    "sideB": [
      "Drag the bottom-left item up.",
      "Pull the item on the bottom-left up.",
      "Move the bottom-left item up.",
      "Drag the bottom-left item upwards",
      "Drag what is on the bottom-left to the top."
    ],
    "note": "**Vocabulary Note:** 'Up', 'upwards', and 'to the top' all indicate the same direction. 'Upwards' is slightly more formal, and 'to the top' is explicit about the destination."
  },
  {
    "cardId": "itc_085",
    "cardType": "flippable",
    "sideA": {
      "text": "Haz doble click en la imagen de la esquina superior derecha.",
      "visualContent": {
        "type": "ascii",
        "value": "↗ (Click-Click)"
      }
    },
    "sideB": [
      "Double-click the image in the top-right corner.",
      "Go ahead and double-click the picture in the upper-right.",
      "Please give the top-right image a double-click.",
      "Double-click on the top-right corner image."
    ],
    "note": "**Usage Note:** The verb 'click' (or 'double-click') can be used with or without the preposition 'on'. Both 'click the button' and 'click on the button' are correct and widely used."
  },
  {
    "cardId": "itc_068",
    "cardType": "flippable",
    "sideA": {
      "text": "Mantén presionado el clic sobre el archivo y arrástralo hacia la ventana del correo.",
      "visualContent": {
        "type": "ascii",
        "value": "File ➡ Email"
      }
    },
    "sideB": [
      "Click and hold on the file, then drag it over to the email window.",
      "Press and hold the mouse button on the file and drag it into the email.",
      "Go ahead and drag and drop that file onto the email window.",
      "Keep the mouse button pressed on the file and drag it to the email window."
    ],
    "note": "**Grammar Note:** The user's suggestion 'Keep press...' is grammatically incorrect. The correct structure is 'Keep pressing...' (using the gerund) or phrases like 'Press and hold' or 'Click and hold'. A corrected alternative has been added."
  },
  {
    "cardId": "itc_109",
    "cardType": "flippable",
    "sideA": {
      "text": "Mueve lo que está a la derecha, hacia la izquierda.",
      "visualContent": {
        "type": "ascii",
        "value": "➡ ⬅"
      }
    },
    "sideB": [
      "Move the item on the right to the left.",
      "Drag the right item to the left.",
      "Shift the item on the right to the left.",
      "Move what is on the right to the left."
    ],
    "note": "**Vocabulary Note:** 'Move', 'drag', and 'shift' can all be used in this context. 'Drag' implies using a mouse, while 'move' and 'shift' are more general."
  },
  {
    "cardId": "itc_082",
    "cardType": "flippable",
    "sideA": {
      "text": "Haz click secundario en el icono de la esquina superior izquierda.",
      "visualContent": {
        "type": "ascii",
        "value": "↖ (Right-Click)"
      }
    },
    "sideB": [
      "Right-click on the icon in the top-left corner.",
      "Can you right-click the icon in the upper-left?",
      "Please give the top-left icon a right-click.",
      "Right-click on the top-left corner icon."
    ],
    "note": "**Usage Note:** 'Right-click' can be used as a verb with or without the preposition 'on'. When describing a location, it's standard to hyphenate it: 'the top-left corner'."
  },
  {
    "cardId": "itc_007",
    "cardType": "flippable",
    "sideA": {
      "text": "Ahora sube hasta el principio de la página.",
      "visualContent": {
        "type": "icon",
        "value": "fas fa-arrow-up"
      }
    },
    "sideB": [
      "Okay, now scroll all the way up to the top.",
      "Can you scroll back to the top of the page?",
      "Go ahead and scroll up to the very top.",
      "Ok, now move to the top of the page."
    ],
    "note": "**Vocabulary Note:** While 'move to the top' is understandable, 'scroll to the top' is the more specific and common verb for navigating vertically within a document or webpage."
  },
  {
    "cardId": "itc_127",
    "cardType": "flippable",
    "sideA": {
      "text": "The button that makes a window fill the entire screen or returns it to its previous size.",
      "visualContent": {
        "type": "icon",
        "value": "far fa-window-maximize"
      }
    },
    "sideB": [
      "Maximize / Restore button",
      "Resize button"
    ],
    "note": "**Technical Note:** The standard industry terms for this control are 'Maximize' (to make it full screen) and 'Restore Down' (to return it to its previous size). 'Adjust button' is too general and not technically correct."
  },
  {
    "cardId": "itc_093",
    "cardType": "flippable",
    "sideA": {
      "text": "Haz click en el botón que está arriba.",
      "visualContent": {
        "type": "icon",
        "value": "fas fa-arrow-circle-up"
      }
    },
    "sideB": [
      "Click the button that's at the top.",
      "Go ahead and click the button above.",
      "Please click the top button.",
      "Click on the top button."
    ],
    "note": "**Usage Note:** The verb 'click' can be used with or without the preposition 'on'. Both 'click the button' and 'click on the button' are correct and widely used."
  }
]