[
  {
    "cardId": "itc_095",
    "cardType": "flippable",
    "sideA": {
      "text": "Arrastra el icono que está a la izquierda hacia la papelera.",
      "visualContent": {
        "type": "ascii",
        "value": "Icon ⬅ 🗑"
      }
    },
    "sideB": [
      "Drag the icon on the left over to the trash.",
      "Go ahead and drag the leftmost icon to the trash can.",
      "Please drag the icon on the left and drop it in the trash.",
      "Drag the item on the left to the right.",
      "Take the icon on the left and move it to the trash can."
    ],
    "note": "Pro-Tip: The phrasal verbs 'drag over to' or 'drag and drop' are very common for this action. 'Trash' and 'trash can' are used interchangeably."
  },
  {
    "cardId": "itc_075",
    "cardType": "flippable",
    "sideA": {
      "text": "Fíjate en la barra de estado de abajo, ¿qué mensaje te aparece?",
      "visualContent": {
        "type": "icon",
        "value": "fas fa-info-circle"
      }
    },
    "sideB": [
      "Check the status bar at the bottom, what message does it show?",
      "Take a look at the status bar down below, what does it say?",
      "Can you tell me what the message is in the status bar at the bottom?",
      "Check the status bar on the bottom, what message does it show?",
      "Look at the status bar at the bottom and tell me the message."
    ],
    "note": "Grammar Note: In this context, 'at the bottom' and 'on the bottom' are both commonly used and correct."
  },
  {
    "cardId": "itc_091",
    "cardType": "flippable",
    "sideA": {
      "text": "Selecciona todo el texto del medio de la pantalla.",
      "visualContent": {
        "type": "icon",
        "value": "fas fa-align-center"
      }
    },
    "sideB": [
      "Select all the text in the middle of the screen.",
      "Go ahead and highlight the text in the center of the screen.",
      "Can you select that block of text in the middle?",
      "Select all the text in the middle of the view.",
      "Highlight all the text in the middle of the display."
    ],
    "note": "Usage Tip: 'Select' and 'highlight' are often used interchangeably when referring to text on a screen."
  },
  {
    "cardId": "itc_049",
    "cardType": "flippable",
    "sideA": {
      "text": "Necesito que aceptes la solicitud para compartir pantalla.",
      "visualContent": {
        "type": "icon",
        "value": "fas fa-user-plus"
      }
    },
    "sideB": [
      "I need you to accept the screen share request.",
      "Please accept the prompt to share your screen.",
      "A request to share your screen should have popped up, please accept it.",
      "I need you to accept the request to share the screen.",
      "Could you please approve the screen sharing request?"
    ],
    "note": "Vocabulary: 'Screen share' is a compound noun. A 'prompt' is a message from the computer that requires a user's action."
  },
  {
    "cardId": "itc_107",
    "cardType": "flippable",
    "sideA": {
      "text": "Arrastra lo que está abajo a la izquierda, hacia arriba.",
      "visualContent": {
        "type": "ascii",
        "value": "↙ ⬆"
      }
    },
    "sideB": [
      "Drag the bottom-left item up.",
      "Pull the item on the bottom-left up.",
      "Move the bottom-left item up.",
      "Drag the bottom-left item upwards.",
      "Drag what is on the bottom-left to the top."
    ],
    "note": "Grammar Note: 'Bottom-left' is a compound adjective and should be hyphenated when it comes before a noun (e.g., 'the bottom-left item')."
  },
  {
    "cardId": "itc_085",
    "cardType": "flippable",
    "sideA": {
      "text": "Haz doble click en la imagen de la esquina superior derecha.",
      "visualContent": {
        "type": "ascii",
        "value": "↗ (Click-Click)"
      }
    },
    "sideB": [
      "Double-click the image in the top-right corner.",
      "Go ahead and double-click the picture in the upper-right.",
      "Please give the top-right image a double-click.",
      "Double-click on the image in the top-right corner.",
      "Find the image in the top-right and double-click it."
    ],
    "note": "Usage Tip: You can say 'double-click the icon' or 'double-click on the icon'. Both are correct and widely used."
  },
  {
    "cardId": "itc_068",
    "cardType": "flippable",
    "sideA": {
      "text": "Mantén presionado el clic sobre el archivo y arrástralo hacia la ventana del correo.",
      "visualContent": {
        "type": "ascii",
        "value": "File ➡ Email"
      }
    },
    "sideB": [
      "Click and hold on the file, then drag it over to the email window.",
      "Press and hold the mouse button on the file and drag it into the email.",
      "Go ahead and drag and drop that file onto the email window.",
      "Hold down the mouse button over the file and move it to the email window."
    ],
    "note": "Grammar Note: The correct phrasings are 'Click and hold' or 'Press and hold'. The phrase 'Keep press' is ungrammatical."
  },
  {
    "cardId": "itc_109",
    "cardType": "flippable",
    "sideA": {
      "text": "Mueve lo que está a la derecha, hacia la izquierda.",
      "visualContent": {
        "type": "ascii",
        "value": "➡ ⬅"
      }
    },
    "sideB": [
      "Move the item on the right to the left.",
      "Drag the right item to the left.",
      "Shift the item on the right to the left.",
      "Move what is on the right to the left.",
      "Take the item from the right side and drag it to the left side."
    ],
    "note": "Vocabulary Tip: 'Move', 'drag', and 'shift' are all good verbs for this action, each with a slightly different nuance."
  },
  {
    "cardId": "itc_082",
    "cardType": "flippable",
    "sideA": {
      "text": "Haz click secundario en el icono de la esquina superior izquierda.",
      "visualContent": {
        "type": "ascii",
        "value": "↖ (Right-Click)"
      }
    },
    "sideB": [
      "Right-click on the icon in the top-left corner.",
      "Can you right-click the icon in the upper-left?",
      "Please give the top-left icon a right-click.",
      "Right-click the icon in the top-left corner.",
      "Perform a right-click on the icon in the upper-left corner."
    ],
    "note": "Grammar Note: 'Right-click' is a compound verb. When used as an adjective before a noun, it's hyphenated, as in 'top-left corner'."
  },
  {
    "cardId": "itc_007",
    "cardType": "flippable",
    "sideA": {
      "text": "Ahora sube hasta el principio de la página.",
      "visualContent": {
        "type": "icon",
        "value": "fas fa-arrow-up"
      }
    },
    "sideB": [
      "Okay, now scroll all the way up to the top.",
      "Can you scroll back to the top of the page?",
      "Go ahead and scroll up to the very top.",
      "Now, please scroll to the beginning of the page."
    ],
    "note": "Usage Tip: For web pages and documents, the idiomatic verb is 'scroll'. Phrases like 'move to the top' are less common in this context."
  },
  {
    "cardId": "itc_127",
    "cardType": "flippable",
    "sideA": {
      "text": "The button that makes a window fill the entire screen or returns it to its previous size.",
      "visualContent": {
        "type": "icon",
        "value": "far fa-window-maximize"
      }
    },
    "sideB": [
      "Maximize / Restore Down button",
      "Resize button",
      "Maximize button",
      "Restore Down button"
    ],
    "note": "Pro-Tip: This button toggles between two states. 'Maximize' makes the window fill the screen. 'Restore Down' returns it to its previous size. The term 'Adjust button' is not standard."
  },
  {
    "cardId": "itc_093",
    "cardType": "flippable",
    "sideA": {
      "text": "Haz click en el botón que está arriba.",
      "visualContent": {
        "type": "icon",
        "value": "fas fa-arrow-circle-up"
      }
    },
    "sideB": [
      "Click the button that's at the top.",
      "Go ahead and click the button above.",
      "Please click the top button.",
      "Click on the top button.",
      "Press the button at the top."
    ],
    "note": "Usage Tip: Both 'click the button' and 'click on the button' are correct and commonly used."
  }
]