{
  "id": "technical_project_plan",
  "name": "Technical Project Plan",
  "description": "Essential conversational pairs for technical project planning meetings. Covers key vocabulary, phrasal verbs, and business idioms.",
  "deckType": "flippable",
  "cards": [
    {
      "cardId": "tpp_001",
      "sideA": {
        "conversation": [
          { "text": "Is this ticket for both the webapp and the mobile apps?", "audioSrc": "public/data/audio/technical_project_plan/tpp_001_a.mp3" },
          { "text": "No, the Test Plan shows this only impacts Android and Apple.", "audioSrc": "public/data/audio/technical_project_plan/tpp_001_b.mp3" }
        ]
      },
      "note": "'Ticket' (Noun) is a single, trackable unit of work, like a bug or task, within a project management system.\n\nA 'Webapp' (Noun) refers to a program accessed through a web browser, distinct from native mobile apps."
    },
    {
      "cardId": "tpp_002",
      "sideA": {
        "conversation": [
          { "text": "What's the current status of Issue #5, the tax problem?", "audioSrc": "public/data/audio/technical_project_plan/tpp_002_a.mp3" },
          { "text": "It's still In Progress. The developer is working on the backend logic.", "audioSrc": "public/data/audio/technical_project_plan/tpp_002_b.mp3" }
        ]
      },
      "note": "'Backend' (Noun) refers to the server-side of an application, where data processing and business logic occur, invisible to the end-user.\n\n'Status' (Noun) defines the current stage of a ticket (e.g., Open, In Progress, Closed)."
    },
    {
      "cardId": "tpp_003",
      "sideA": {
        "conversation": [
          { "text": "When I search for the SKU, the item does not come up.", "audioSrc": "public/data/audio/technical_project_plan/tpp_003_a.mp3" },
          { "text": "Okay, can you create a new Issue # for that in the Issue Log?", "audioSrc": "public/data/audio/technical_project_plan/tpp_003_b.mp3" }
        ]
      },
      "note": "'SKU' (Stock Keeping Unit) (Noun) is a unique alphanumeric code to identify a specific product.\n\n'Come up' (Phrasal Verb) means to appear or be found, especially in search results."
    },
    {
      "cardId": "tpp_004",
      "sideA": {
        "conversation": [
          { "text": "Can you pull up the order in the Oracle Order Organizer?", "audioSrc": "public/data/audio/technical_project_plan/tpp_004_a.mp3" },
          { "text": "Yes, but the Order Source field, Attribute11, is empty.", "audioSrc": "public/data/audio/technical_project_plan/tpp_004_b.mp3" }
        ]
      },
      "note": "'Pull up' (Phrasal Verb) means to retrieve and display information on a screen.\n\n'Attribute11' (Noun) is an example of a specific, technical field name within a database (like Oracle EBS) used for custom data."
    },
    {
      "cardId": "tpp_005",
      "sideA": {
        "conversation": [
          { "text": "The French text does not fit within the Checkout Screen button.", "audioSrc": "public/data/audio/technical_project_plan/tpp_005_a.mp3" },
          { "text": "I agree. That's a high priority frontend bug.", "audioSrc": "public/data/audio/technical_project_plan/tpp_005_b.mp3" }
        ]
      },
      "note": "'Frontend' (Noun) is the part of an application that the user directly interacts with (the User Interface).\n\n'Fit within' (Phrasal Verb) describes if an element's size is appropriate for its container."
    },
    {
      "cardId": "tpp_006",
      "sideA": {
        "conversation": [
          { "text": "To test this, I need to log into an account with a Sales Rep Profile.", "audioSrc": "public/data/audio/technical_project_plan/tpp_006_a.mp3" },
          { "text": "No problem, the credentials are in the Test Cases document.", "audioSrc": "public/data/audio/technical_project_plan/tpp_006_b.mp3" }
        ]
      },
      "note": "'Log into' (Phrasal Verb) means to gain access to a computer system using credentials.\n\nA 'Profile' (Noun) defines a user's permissions and access level."
    },
    {
      "cardId": "tpp_007",
      "sideA": {
        "conversation": [
          { "text": "The user sees the wrong price. What is it coming up as?", "audioSrc": "public/data/audio/technical_project_plan/tpp_007_a.mp3" },
          { "text": "It's coming up as the List Price. It should be showing the Net Price after the discount.", "audioSrc": "public/data/audio/technical_project_plan/tpp_007_b.mp3" }
        ]
      },
      "note": "'List Price' (Noun) is the standard, advertised price before any adjustments.\n\n'Net Price' (Noun) is the final price after discounts and fees are applied.\n\n'Coming up as' (Phrasal Verb) means appearing or being displayed as."
    },
    {
      "cardId": "tpp_008",
      "sideA": {
        "conversation": [
          { "text": "So, the Ecofee must be based on a rate per bottle, correct?", "audioSrc": "public/data/audio/technical_project_plan/tpp_008_a.mp3" },
          { "text": "Yes, and the final amount should be included in the Sub-Total, not shown separately.", "audioSrc": "public/data/audio/technical_project_plan/tpp_008_b.mp3" }
        ]
      },
      "note": "'Based on' (Phrasal Verb) means using something as the foundation for a calculation or decision.\n\n'Ecofee' (Noun) is a specific environmental fee, common in certain regions."
    },
    {
      "cardId": "tpp_009",
      "sideA": {
        "conversation": [
          { "text": "Is the latest version available on Testflight yet?", "audioSrc": "public/data/audio/technical_project_plan/tpp_009_a.mp3" },
          { "text": "Yes, it was uploaded this morning. You can start the UAT.", "audioSrc": "public/data/audio/technical_project_plan/tpp_009_b.mp3" }
        ]
      },
      "note": "'Testflight' (Proper Noun) is Apple's platform for testing pre-release iOS apps.\n\n'UAT' (User Acceptance Testing) (Noun) is the final testing phase where business users validate the software."
    },
    {
      "cardId": "tpp_010",
      "sideA": {
        "conversation": [
          { "text": "Was the on-premise customer able to order below the minimum quantity?", "audioSrc": "public/data/audio/technical_project_plan/tpp_010_a.mp3" },
          { "text": "No, the test passed. The user was prevented from doing so.", "audioSrc": "public/data/audio/technical_project_plan/tpp_010_b.mp3" }
        ]
      },
      "note": "'On-premise' (Adjective) describes a business that sells goods for immediate consumption (e.g., a restaurant).\n\n'Prevented from doing so' (Verb Phrase) means an action was blocked by the system, often as part of a validation rule."
    },
    {
      "cardId": "tpp_011",
      "sideA": {
        "conversation": [
          { "text": "I tried to fill in the details for the Return Reason.", "audioSrc": "public/data/audio/technical_project_plan/tpp_011_a.mp3" },
          { "text": "And what happened when you tried to submit the return?", "audioSrc": "public/data/audio/technical_project_plan/tpp_011_b.mp3" }
        ]
      },
      "note": "'Fill in' (Phrasal Verb) means to enter information into the blank fields of a form.\n\nA 'Return Reason' (Noun) is the justification a user provides when returning a product."
    },
    {
      "cardId": "tpp_012",
      "sideA": {
        "conversation": [
          { "text": "Before I place the order, I need to confirm the Delivery Date.", "audioSrc": "public/data/audio/technical_project_plan/tpp_012_a.mp3" },
          { "text": "Good idea. Make sure it matches what you selected on the customer screen.", "audioSrc": "public/data/audio/technical_project_plan/tpp_012_b.mp3" }
        ]
      },
      "note": "'Place the order' (Verb Phrase) is the key action of finalizing a purchase in e-commerce.\n\n'Delivery Date' (Noun) is the scheduled date for receiving goods, distinct from the 'Order Date'."
    },
    {
      "cardId": "tpp_013",
      "sideA": {
        "conversation": [
          { "text": "After the order is booked, has it been released to AGLC?", "audioSrc": "public/data/audio/technical_project_plan/tpp_013_a.mp3" },
          { "text": "Let me check the EBS. Yes, it was released.", "audioSrc": "public/data/audio/technical_project_plan/tpp_013_b.mp3" }
        ]
      },
      "note": "An order is 'Booked' (Verb) when it's officially confirmed in the system.\n\n'Released to AGLC' is a specific business process involving the Alberta Gaming, Liquor and Cannabis commission."
    },
    {
      "cardId": "tpp_014",
      "sideA": {
        "conversation": [
          { "text": "Does the superscript number refer to the correct Legal Note?", "audioSrc": "public/data/audio/technical_project_plan/tpp_014_a.mp3" },
          { "text": "Yes, it correctly links to the disclaimer at the bottom of the Shopping Cart.", "audioSrc": "public/data/audio/technical_project_plan/tpp_014_b.mp3" }
        ]
      },
      "note": "'Superscript' (Noun) is text raised slightly above the line (like ยน), often used for footnotes.\n\n'Refer to' (Phrasal Verb) means to direct attention to something for information."
    },
    {
      "cardId": "tpp_015",
      "sideA": {
        "conversation": [
          { "text": "This ticket is about renaming 'Total Price' to 'Regular Price'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_015_a.mp3" },
          { "text": "Correct. This needs to be validated on both the Cart Screen and the Checkout Screen.", "audioSrc": "public/data/audio/technical_project_plan/tpp_015_b.mp3" }
        ]
      },
      "note": "The 'Checkout Screen' (Noun) is the final step in an online purchase. Renaming UI elements is a common task, often called a 'copy change' or 'label change'."
    },
    {
      "cardId": "tpp_016",
      "sideA": {
        "conversation": [
          { "text": "The user can't add to the cart. What's the issue?", "audioSrc": "public/data/audio/technical_project_plan/tpp_016_a.mp3" },
          { "text": "It seems that specific SKU is out of stock in the database.", "audioSrc": "public/data/audio/technical_project_plan/tpp_016_b.mp3" }
        ]
      },
      "note": "'Out of stock' (Adjective Phrase) means a product is unavailable for purchase. This is a critical status that directly impacts revenue and user experience."
    },
    {
      "cardId": "tpp_017",
      "sideA": {
        "conversation": [
          { "text": "I can't access the test webapp. Do you have the URL?", "audioSrc": "public/data/audio/technical_project_plan/tpp_017_a.mp3" },
          { "text": "Sure, I'll send you the Proxy Server URL from the 'Test Links' tab.", "audioSrc": "public/data/audio/technical_project_plan/tpp_017_b.mp3" }
        ]
      },
      "note": "A 'URL' (Uniform Resource Locator) (Noun) is the web address.\n\nA 'Proxy Server' (Noun) acts as a gateway between a user and the internet, often for security or to access internal networks."
    },
    {
      "cardId": "tpp_018",
      "sideA": {
        "conversation": [
          { "text": "The user can't find their invoice when they search by date range.", "audioSrc": "public/data/audio/technical_project_plan/tpp_018_a.mp3" },
          { "text": "Okay, that's a new bug. I will create an Issue # for it.", "audioSrc": "public/data/audio/technical_project_plan/tpp_018_b.mp3" }
        ]
      },
      "note": "'Date Range' (Noun) is a period between a start and end date, used for filtering searches.\n\nAn 'Invoice' (Noun) is the official bill for a transaction."
    },
    {
      "cardId": "tpp_019",
      "sideA": {
        "conversation": [
          { "text": "Why is the order status showing as Entered and not Booked?", "audioSrc": "public/data/audio/technical_project_plan/tpp_019_a.mp3" },
          { "text": "That's the bug. It seems the order was not fully processed by the backend.", "audioSrc": "public/data/audio/technical_project_plan/tpp_019_b.mp3" }
        ]
      },
      "note": "'Entered' (Adjective) is an initial order status. 'Booked' (Adjective) is the final, confirmed status.\n\nA failure to transition between them often points to a backend processing error."
    },
    {
      "cardId": "tpp_020",
      "sideA": {
        "conversation": [
          { "text": "Is this bug happening on both Android and Apple devices?", "audioSrc": "public/data/audio/technical_project_plan/tpp_020_a.mp3" },
          { "text": "So far, the Issue Log only shows reports from Android users in the AB region.", "audioSrc": "public/data/audio/technical_project_plan/tpp_020_b.mp3" }
        ]
      },
      "note": "Specifying the operating 'System' (Noun) (e.g., Android, Apple/iOS) and region (e.g., AB for Alberta) is critical for accurately reporting and debugging an issue."
    },
    {
      "cardId": "tpp_021",
      "sideA": {
        "conversation": [
          { "text": "Clicking the price should open a pop-up window with the price details.", "audioSrc": "public/data/audio/technical_project_plan/tpp_021_a.mp3" },
          { "text": "I tested it, and the pop-up window is not appearing.", "audioSrc": "public/data/audio/technical_project_plan/tpp_021_b.mp3" }
        ]
      },
      "note": "A 'Pop-up window' (Noun) is a small window that appears over the main application screen. It's a common UI pattern for showing details without leaving the current page."
    },
    {
      "cardId": "tpp_022",
      "sideA": {
        "conversation": [
          { "text": "Is the hyperlink in the Legal Note working?", "audioSrc": "public/data/audio/technical_project_plan/tpp_022_a.mp3" },
          { "text": "Yes, I clicked it and it correctly opens the consignaction.ca website.", "audioSrc": "public/data/audio/technical_project_plan/tpp_022_b.mp3" }
        ]
      },
      "note": "A 'Hyperlink' (Noun) is clickable text or an image that navigates the user to another web page or resource. Verifying hyperlinks is a standard part of UI testing."
    },
    {
      "cardId": "tpp_023",
      "sideA": {
        "conversation": [
          { "text": "Does the Net Unit Price calculation include the Ecofee?", "audioSrc": "public/data/audio/technical_project_plan/tpp_023_a.mp3" },
          { "text": "It should. The formula is List Price minus Discount plus Ecofee.", "audioSrc": "public/data/audio/technical_project_plan/tpp_023_b.mp3" }
        ]
      },
      "note": "'Net Unit Price' (Noun) is the cost of a single item after all pricing rules have been applied. Defining and testing the calculation formula is crucial for financial accuracy."
    },
    {
      "cardId": "tpp_024",
      "sideA": {
        "conversation": [
          { "text": "This UI issue seems straightforward. Who is the developer on this ticket?", "audioSrc": "public/data/audio/technical_project_plan/tpp_024_a.mp3" },
          { "text": "According to the Test Plan, Seb is responsible for this Series ID.", "audioSrc": "public/data/audio/technical_project_plan/tpp_024_b.mp3" }
        ]
      },
      "note": "A 'Developer' (Noun) is a programmer who writes code.\n\nA 'Series ID' (Noun) is a project-specific identifier for a group of related tests or features."
    },
    {
      "cardId": "tpp_025",
      "sideA": {
        "conversation": [
          { "text": "The bug about the wrong Return Reason should be fixed now.", "audioSrc": "public/data/audio/technical_project_plan/tpp_025_a.mp3" },
          { "text": "Okay, I will change its status to Retest and validate it today.", "audioSrc": "public/data/audio/technical_project_plan/tpp_025_b.mp3" }
        ]
      },
      "note": "'Retest' (Verb/Noun) is the status or action of verifying a bug fix. This is a key step in the quality assurance (QA) lifecycle before closing an issue."
    },
    {
      "cardId": "tpp_026",
      "sideA": {
        "conversation": [
          { "text": "Does the minimum quantity rule apply to both on-premise and retail customers?", "audioSrc": "public/data/audio/technical_project_plan/tpp_026_a.mp3" },
          { "text": "Yes, but the actual quantity is different depending on the customer profile.", "audioSrc": "public/data/audio/technical_project_plan/tpp_026_b.mp3" }
        ]
      },
      "note": "'Minimum Quantity' (Noun) is a business rule that enforces a lower limit on order size. Testing that this rule applies correctly to different customer 'Profiles' (Noun) is essential."
    },
    {
      "cardId": "tpp_027",
      "sideA": {
        "conversation": [
          { "text": "The Issue Log says the Return Reason options are not translated into French.", "audioSrc": "public/data/audio/technical_project_plan/tpp_027_a.mp3" },
          { "text": "That's right. The user is in QC-FR but the frontend is showing English text.", "audioSrc": "public/data/audio/technical_project_plan/tpp_027_b.mp3" }
        ]
      },
      "note": "'Translated' (Adjective) refers to text converted into another language. A failure in translation is a type of 'internationalization' or 'localization' bug, often denoted as i18n."
    },
    {
      "cardId": "tpp_028",
      "sideA": {
        "conversation": [
          { "text": "I need to see the Sub-Total, taxes, and deposit on the Invoice details screen.", "audioSrc": "public/data/audio/technical_project_plan/tpp_028_a.mp3" },
          { "text": "Okay, that's Series ID 10.0.0. Let me check the test results.", "audioSrc": "public/data/audio/technical_project_plan/tpp_028_b.mp3" }
        ]
      },
      "note": "'Sub-Total' (Noun) is the cost of items before taxes and fees. The final 'Invoice' (Noun) must accurately break down all components of the total price."
    },
    {
      "cardId": "tpp_029",
      "sideA": {
        "conversation": [
          { "text": "We need to validate that the app version number is displayed on the login screen.", "audioSrc": "public/data/audio/technical_project_plan/tpp_029_a.mp3" },
          { "text": "Yes, that's the main task for Series ID 12.0.0, the iStore Mobile - Version ticket.", "audioSrc": "public/data/audio/technical_project_plan/tpp_029_b.mp3" }
        ]
      },
      "note": "Displaying the app 'version number' (Noun) is a standard requirement. It's crucial for support and bug reporting, as it helps identify which release a user is on."
    },
    {
      "cardId": "tpp_030",
      "sideA": {
        "conversation": [
          { "text": "Overall, what is the main goal of the Quebec CRF project?", "audioSrc": "public/data/audio/technical_project_plan/tpp_030_a.mp3" },
          { "text": "The main goal is to add the new Ecofee and ensure all pricing and legal notes are correctly displayed for QC users.", "audioSrc": "public/data/audio/technical_project_plan/tpp_030_b.mp3" }
        ]
      },
      "note": "Understanding the high-level 'goal' (Noun) of a project is essential for all team members. It provides context and helps in prioritizing tasks."
    },
    {
      "cardId": "tpp_031",
      "sideA": {
        "conversation": [
          { "text": "For Series ID 2.0.0, where should the Delivery Fee tile be located?", "audioSrc": "public/data/audio/technical_project_plan/tpp_031_a.mp3" },
          { "text": "It should be under the Sub-Total and the Taxes must include GST on the fee.", "audioSrc": "public/data/audio/technical_project_plan/tpp_031_b.mp3" }
        ]
      },
      "note": "A 'Tile' (Noun) is a modular, self-contained block in a UI.\n\nThe placement and taxability of a 'Delivery Fee' (Noun) are critical business and legal requirements."
    },
    {
      "cardId": "tpp_032",
      "sideA": {
        "conversation": [
          { "text": "Is our new mobile service communicating directly with the Oracle EBS?", "audioSrc": "public/data/audio/technical_project_plan/tpp_032_a.mp3" },
          { "text": "Yes, it follows our Service-Oriented Architecture (SOA) design.", "audioSrc": "public/data/audio/technical_project_plan/tpp_032_b.mp3" }
        ]
      },
      "note": "'SOA' (Service-Oriented Architecture) (Noun) is a design pattern where software components communicate as independent services.\n\n'EBS' (Oracle E-Business Suite) is a comprehensive suite of business applications."
    },
    {
      "cardId": "tpp_033",
      "sideA": {
        "conversation": [
          { "text": "Marc reported Issue #15 that an item does not exist. What was the resolution?", "audioSrc": "public/data/audio/technical_project_plan/tpp_033_a.mp3" },
          { "text": "We closed it. The business confirmed that product is no longer sold, so the test is not applicable.", "audioSrc": "public/data/audio/technical_project_plan/tpp_033_b.mp3" }
        ]
      },
      "note": "The 'resolution' (Noun) of a ticket is its final outcome.\n\nA test can be 'not applicable' (Adjective Phrase) if the business rules or data have changed, making the original test case invalid."
    },
    {
      "cardId": "tpp_034",
      "sideA": {
        "conversation": [
          { "text": "For Test Task # 8.1.3, what am I validating?", "audioSrc": "public/data/audio/technical_project_plan/tpp_034_a.mp3" },
          { "text": "You need to validate that a sales rep has the option to switch between their different customers.", "audioSrc": "public/data/audio/technical_project_plan/tpp_034_b.mp3" }
        ]
      },
      "note": "A 'Test Task' (Noun) is a specific, actionable instruction within a larger Test Plan.\n\n'Validating' (Verb) is the act of confirming that a feature works according to its requirements."
    },
    {
      "cardId": "tpp_035",
      "sideA": {
        "conversation": [
          { "text": "The 'not a valid month' bug (Issue #9 and #10) is blocking our QC testers.", "audioSrc": "public/data/audio/technical_project_plan/tpp_035_a.mp3" },
          { "text": "I agree, this has the highest priority. The users cannot book an order.", "audioSrc": "public/data/audio/technical_project_plan/tpp_035_b.mp3" }
        ]
      },
      "note": "A 'blocking' issue (or 'blocker') (Noun) is a critical bug that prevents testers from proceeding with other tests. It always has the highest 'priority' (Noun)."
    },
    {
      "cardId": "tpp_036",
      "sideA": {
        "conversation": [
          { "text": "Where can I find a list of CSR Profile accounts for testing?", "audioSrc": "public/data/audio/technical_project_plan/tpp_036_a.mp3" },
          { "text": "Please refer to the Data sheet in the Test Plan.", "audioSrc": "public/data/audio/technical_project_plan/tpp_036_b.mp3" }
        ]
      },
      "note": "A 'Data sheet' (Noun) is a document or spreadsheet containing the specific data (like test accounts) needed to execute test cases.\n\n'CSR' stands for Customer Service Representative."
    },
    {
      "cardId": "tpp_037",
      "sideA": {
        "conversation": [
          { "text": "Is the 'Account Search Tool' a Project or a Ticket?", "audioSrc": "public/data/audio/technical_project_plan/tpp_037_a.mp3" },
          { "text": "It's a Ticket, specifically INC-22159. Projects are usually for larger, new features.", "audioSrc": "public/data/audio/technical_project_plan/tpp_037_b.mp3" }
        ]
      },
      "note": "Differentiating between a 'Project' (Noun) and a 'Ticket' (Noun) is key for scoping work. Tickets (or Incidents, like 'INC') are typically smaller, discrete tasks."
    },
    {
      "cardId": "tpp_038",
      "sideA": {
        "conversation": [
          { "text": "The notes say 'the invoice does not come up'. What does come up mean?", "audioSrc": "public/data/audio/technical_project_plan/tpp_038_a.mp3" },
          { "text": "It means the invoice does not appear in the search results.", "audioSrc": "public/data/audio/technical_project_plan/tpp_038_b.mp3" }
        ]
      },
      "note": "'Come up' (Phrasal Verb) is a common colloquialism in tech that means 'to appear' or 'to be displayed', particularly in lists or search results."
    },
    {
      "cardId": "tpp_039",
      "sideA": {
        "conversation": [
          { "text": "Does the BC region have the same Ecofee as QC?", "audioSrc": "public/data/audio/technical_project_plan/tpp_039_a.mp3" },
          { "text": "No, the Ecofee requirement is only for Quebec. It doesn't apply to BC.", "audioSrc": "public/data/audio/technical_project_plan/tpp_039_b.mp3" }
        ]
      },
      "note": "Business rules are often region-specific. Confirming that a rule 'applies to' (Verb Phrase) a certain region is a common testing task. (BC = British Columbia, QC = Quebec)."
    },
    {
      "cardId": "tpp_040",
      "sideA": {
        "conversation": [
          { "text": "Have we tested the Shopping Cart functionality on an Android tablet?", "audioSrc": "public/data/audio/technical_project_plan/tpp_040_a.mp3" },
          { "text": "Let me check the Test Cases. So far, we've only tested on phones.", "audioSrc": "public/data/audio/technical_project_plan/tpp_040_b.mp3" }
        ]
      },
      "note": "'Test Coverage' (Noun) refers to the extent to which testing has encompassed all required platforms (e.g., phones, tablets), browsers, and devices. Incomplete coverage is a project risk."
    },
    {
      "cardId": "tpp_041",
      "sideA": {
        "conversation": [
          { "text": "The Test Case says to 'center align the Total row'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_041_a.mp3" },
          { "text": "Yes, and also 'bold format the Total label' for better visibility on the UI.", "audioSrc": "public/data/audio/technical_project_plan/tpp_041_b.mp3" }
        ]
      },
      "note": "'Align' (Verb) and 'format' (Verb) are specific UI instructions. Testing includes verifying not just functionality, but also visual presentation against design specifications."
    },
    {
      "cardId": "tpp_042",
      "sideA": {
        "conversation": [
          { "text": "Let's look into why the Return Reason is mapping incorrectly from 'Moldy' to 'Breakage'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_042_a.mp3" },
          { "text": "I think it's a backend issue. The database is sending the wrong ID to the frontend.", "audioSrc": "public/data/audio/technical_project_plan/tpp_042_b.mp3" }
        ]
      },
      "note": "'Look into' (Phrasal Verb) means to investigate or research a problem.\n\nAn incorrect 'mapping' (Noun) often points to a data issue where one value is wrongly converted to another, frequently a backend problem."
    },
    {
      "cardId": "tpp_043",
      "sideA": {
        "conversation": [
          { "text": "Let's go through the pricing logic again. It must be based on a specific date.", "audioSrc": "public/data/audio/technical_project_plan/tpp_043_a.mp3" },
          { "text": "Correct. It's always the Order Date, never the Delivery Date, even if the delivery is next week.", "audioSrc": "public/data/audio/technical_project_plan/tpp_043_b.mp3" }
        ]
      },
      "note": "'Go through' (Phrasal Verb) means to review something carefully.\n\nEstablishing the correct date to use for pricing ('Order Date' vs. 'Delivery Date') is a critical business rule to prevent revenue loss."
    },
    {
      "cardId": "tpp_044",
      "sideA": {
        "conversation": [
          { "text": "I need to set up the test for the Under Minimum ticket. It seems complex.", "audioSrc": "public/data/audio/technical_project_plan/tpp_044_a.mp3" },
          { "text": "Yes, you need to use two customer profiles: one on-premise and one off-premise to see the different limits.", "audioSrc": "public/data/audio/technical_project_plan/tpp_044_b.mp3" }
        ]
      },
      "note": "'Set up' (Phrasal Verb) means to prepare the necessary conditions for a task. Complex tests often require specific data setups, such as using multiple user profiles."
    },
    {
      "cardId": "tpp_045",
      "sideA": {
        "conversation": [
          { "text": "If an order is booked in the iStore app, how do we prove it reached the EBS?", "audioSrc": "public/data/audio/technical_project_plan/tpp_045_a.mp3" },
          { "text": "You have to pull it up by order number in the Oracle Order Organizer to validate that it exists there.", "audioSrc": "public/data/audio/technical_project_plan/tpp_045_b.mp3" }
        ]
      },
      "note": "Validating 'inter-system communication' (Noun Phrase) is crucial. Proving data exists in a downstream system (like EBS) after an action in an upstream system (iStore) is a common end-to-end test."
    },
    {
      "cardId": "tpp_046",
      "sideA": {
        "conversation": [
          { "text": "Has this critical issue been logged in our official IT system?", "audioSrc": "public/data/audio/technical_project_plan/tpp_046_a.mp3" },
          { "text": "Yes, the FreshService Ticket # has been added to our internal Issue Log for reference.", "audioSrc": "public/data/audio/technical_project_plan/tpp_046_b.mp3" }
        ]
      },
      "note": "Teams often use an 'internal' (Adjective) tracking system (like an Issue Log) and an 'official' (Adjective) IT system (like FreshService) for client communication. Linking the two is important."
    },
    {
      "cardId": "tpp_047",
      "sideA": {
        "conversation": [
          { "text": "We can't test the new Checkout Screen until the pricing bug is fixed.", "audioSrc": "public/data/audio/technical_project_plan/tpp_047_a.mp3" },
          { "text": "I understand the dependency. I will tell the developer to raise the priority on the pricing ticket.", "audioSrc": "public/data/audio/technical_project_plan/tpp_047_b.mp3" }
        ]
      },
      "note": "A 'dependency' (Noun) is when one task cannot start until another is finished. Identifying and managing dependencies is a key part of project management."
    },
    {
      "cardId": "tpp_048",
      "sideA": {
        "conversation": [
          { "text": "We need to figure out why the Taxes are not showing on the Cart Screen.", "audioSrc": "public/data/audio/technical_project_plan/tpp_048_a.mp3" },
          { "text": "I'll deal with it. I suspect it's a frontend rendering issue on Android.", "audioSrc": "public/data/audio/technical_project_plan/tpp_048_b.mp3" }
        ]
      },
      "note": "'Figure out' (Phrasal Verb) means to solve or understand a problem.\n\n'Deal with it' (Phrasal Verb) is a common, direct way to say 'I will take responsibility for solving this'."
    },
    {
      "cardId": "tpp_049",
      "sideA": {
        "conversation": [
          { "text": "Which URL do I use to test the application itself?", "audioSrc": "public/data/audio/technical_project_plan/tpp_049_a.mp3" },
          { "text": "Use the Proxy Server URL. The Web Logic Server URL is for the developers to check backend services.", "audioSrc": "public/data/audio/technical_project_plan/tpp_049_b.mp3" }
        ]
      },
      "note": "It's common to have multiple URLs for a project. The 'Proxy Server' (Noun) URL is typically for user-level interaction, while a direct server URL (like Web Logic) is for developers to test backend 'services' (Noun)."
    },
    {
      "cardId": "tpp_050",
      "sideA": {
        "conversation": [
          { "text": "What's the objective of Series ID 7.0.0, the Pricing Date ticket?", "audioSrc": "public/data/audio/technical_project_plan/tpp_050_a.mp3" },
          { "text": "The objective is to validate that the price is always determined by the Order Date.", "audioSrc": "public/data/audio/technical_project_plan/tpp_050_b.mp3" }
        ]
      },
      "note": "Each ticket or task should have a clear 'objective' (Noun). This helps focus the work and defines what a successful outcome looks like."
    },
    {
      "cardId": "tpp_051",
      "sideA": {
        "conversation": [
          { "text": "Let's go over Issue #2. The bug says options are being given in English.", "audioSrc": "public/data/audio/technical_project_plan/tpp_051_a.mp3" },
          { "text": "Yes, even when the user changes the app language to French, the Return Reason pop-up window stays in English.", "audioSrc": "public/data/audio/technical_project_plan/tpp_051_b.mp3" }
        ]
      },
      "note": "'Go over' (Phrasal Verb) means to review or examine the details of something. This is a classic localization bug where part of the UI doesn't respect the user's selected language."
    },
    {
      "cardId": "tpp_052",
      "sideA": {
        "conversation": [
          { "text": "Where in the database do we store the Order Source?", "audioSrc": "public/data/audio/technical_project_plan/tpp_052_a.mp3" },
          { "text": "It's stored in the Additional Header Information section, specifically in the field named attribute11.", "audioSrc": "public/data/audio/technical_project_plan/tpp_052_b.mp3" }
        ]
      },
      "note": "A 'database' (Noun) is the organized collection of data. Knowing the specific field name (like 'attribute11') is crucial for developers and testers to verify data integrity."
    },
    {
      "cardId": "tpp_053",
      "sideA": {
        "conversation": [
          { "text": "Can we automate the test case for checking the minimum quantity?", "audioSrc": "public/data/audio/technical_project_plan/tpp_053_a.mp3" },
          { "text": "It might be difficult, because it requires switching between different customer profiles.", "audioSrc": "public/data/audio/technical_project_plan/tpp_053_b.mp3" }
        ]
      },
      "note": "To 'automate' (Verb) a test case means to write a script that can run it without human intervention. Tests requiring complex setups, like switching user profiles, are often challenging to automate."
    },
    {
      "cardId": "tpp_054",
      "sideA": {
        "conversation": [
          { "text": "The tester reported that a brand logo is missing.", "audioSrc": "public/data/audio/technical_project_plan/tpp_054_a.mp3" },
          { "text": "We should check if that brand is still sold in the SK region. It might be a 'not applicable' issue.", "audioSrc": "public/data/audio/technical_project_plan/tpp_054_b.mp3" }
        ]
      },
      "note": "Before fixing a bug, it's important to verify if it's still relevant. If the underlying business context has changed, the issue might be 'not applicable' (Adjective Phrase)."
    },
    {
      "cardId": "tpp_055",
      "sideA": {
        "conversation": [
          { "text": "Seb is assigned to almost every ticket. Does he have enough time?", "audioSrc": "public/data/audio/technical_project_plan/tpp_055_a.mp3" },
          { "text": "Let's review the priorities. We might need to move some lower priority tickets to the next release.", "audioSrc": "public/data/audio/technical_project_plan/tpp_055_b.mp3" }
        ]
      },
      "note": "Assessing developer workload and 'priorities' (Noun) is a key project management task.\n\nMoving tickets to a future 'release' (Noun) is a common way to manage scope."
    },
    {
      "cardId": "tpp_056",
      "sideA": {
        "conversation": [
          { "text": "The user wants to see the Ecofee as a separate line item.", "audioSrc": "public/data/audio/technical_project_plan/tpp_056_a.mp3" },
          { "text": "I understand, but the legal requirement in the Test Plan says it must be included in the Sub-Total.", "audioSrc": "public/data/audio/technical_project_plan/tpp_056_b.mp3" }
        ]
      },
      "note": "There can be a conflict between 'user experience' (what the user wants) and a 'legal requirement' (what must be done by law).\n\nIn these cases, the legal requirement always wins."
    },
    {
      "cardId": "tpp_057",
      "sideA": {
        "conversation": [
          { "text": "The pop-up window for pricing details works on Apple, but not on Android.", "audioSrc": "public/data/audio/technical_project_plan/tpp_057_a.mp3" },
          { "text": "Okay, we need to ensure the user experience is consistent. Please log a new issue for the Android UI.", "audioSrc": "public/data/audio/technical_project_plan/tpp_057_b.mp3" }
        ]
      },
      "note": "'Cross-platform consistency' (Noun Phrase) is the principle that a feature should look and behave similarly on all supported platforms (e.g., Apple and Android). A deviation is typically a bug."
    },
    {
      "cardId": "tpp_058",
      "sideA": {
        "conversation": [
          { "text": "We have conflicting reports about the Delivery Date bug.", "audioSrc": "public/data/audio/technical_project_plan/tpp_058_a.mp3" },
          { "text": "Let's have a quick call with the testers to sort out the exact steps to reproduce it.", "audioSrc": "public/data/audio/technical_project_plan/tpp_058_b.mp3" }
        ]
      },
      "note": "'Sort out' (Phrasal Verb) means to resolve a confusion or organize something.\n\nFinding the exact 'steps to reproduce' a bug is the most critical piece of information for a developer."
    },
    {
      "cardId": "tpp_059",
      "sideA": {
        "conversation": [
          { "text": "Why did the test with the on-premise account fail?", "audioSrc": "public/data/audio/technical_project_plan/tpp_059_a.mp3" },
          { "text": "It seems the test data was wrong. That account was not set up correctly in the EBS.", "audioSrc": "public/data/audio/technical_project_plan/tpp_059_b.mp3" }
        ]
      },
      "note": "'Data integrity' (Noun Phrase) is crucial for testing. If the underlying test data is incorrect or not 'set up' (Phrasal Verb) properly, test results will be invalid."
    },
    {
      "cardId": "tpp_060",
      "sideA": {
        "conversation": [
          { "text": "Before the release, we must go over the 'Go Live Checklist'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_060_a.mp3" },
          { "text": "Agreed. We must confirm all high-priority issues are Closed and all UAT has passed.", "audioSrc": "public/data/audio/technical_project_plan/tpp_060_b.mp3" }
        ]
      },
      "note": "A 'Go Live Checklist' (Noun) is a final list of tasks and checks to be completed before a new version is deployed to production. It's a critical risk-mitigation step."
    },
    {
      "cardId": "tpp_061",
      "sideA": {
        "conversation": [
          { "text": "Is the SOA endpoint for the iStore Mobile pricing service public?", "audioSrc": "public/data/audio/technical_project_plan/tpp_061_a.mp3" },
          { "text": "No, it's internal. All calls must go through the Web Logic Server via the Proxy Server.", "audioSrc": "public/data/audio/technical_project_plan/tpp_061_b.mp3" }
        ]
      },
      "note": "An 'endpoint' (Noun) is a specific URL where a service can be accessed. Differentiating between 'public' (Adjective) and 'internal' (Adjective) endpoints is fundamental to understanding system security and architecture."
    },
    {
      "cardId": "tpp_062",
      "sideA": {
        "conversation": [
          { "text": "The Test Case for the delivery fee says to 'increase the font size of the Total amount'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_062_a.mp3" },
          { "text": "Right, the business wants the final total to be very prominent and easy to read on the Checkout Screen.", "audioSrc": "public/data/audio/technical_project_plan/tpp_062_b.mp3" }
        ]
      },
      "note": "'Prominent' (Adjective) means important or easily seen. UI requirements often include visual styling details like 'font size' (Noun) to improve readability and emphasize key information."
    },
    {
      "cardId": "tpp_063",
      "sideA": {
        "conversation": [
          { "text": "The note says 'the search is now working'. What does now working imply?", "audioSrc": "public/data/audio/technical_project_plan/tpp_063_a.mp3" },
          { "text": "It implies that it was previously broken, but a fix was deployed and it has been re-tested successfully.", "audioSrc": "public/data/audio/technical_project_plan/tpp_063_b.mp3" }
        ]
      },
      "note": "The word 'now' (Adverb) in a status update often implies a change of state. 'Now working' means the transition from a 'broken' (Adjective) state to a functional one."
    },
    {
      "cardId": "tpp_064",
      "sideA": {
        "conversation": [
          { "text": "If a product price changes tomorrow, and I place the order today for delivery next week, which price do I pay?", "audioSrc": "public/data/audio/technical_project_plan/tpp_064_a.mp3" },
          { "text": "You pay today's price. The pricing is always based on the Order Date.", "audioSrc": "public/data/audio/technical_project_plan/tpp_064_b.mp3" }
        ]
      },
      "note": "A 'nuanced' (Adjective) business rule is one with subtle but important details. Testing these edge cases, like future price changes, is critical for application correctness."
    },
    {
      "cardId": "tpp_065",
      "sideA": {
        "conversation": [
          { "text": "Let's break down the failure. Is the Total Price wrong, or is the Net Unit Price wrong?", "audioSrc": "public/data/audio/technical_project_plan/tpp_065_a.mp3" },
          { "text": "The Net Unit Price is correct, but the Total Price isn't multiplying it by the quantity correctly.", "audioSrc": "public/data/audio/technical_project_plan/tpp_065_b.mp3" }
        ]
      },
      "note": "'Break down' (Phrasal Verb) means to analyze something by separating it into smaller parts. This is a fundamental debugging technique to isolate the root cause of a problem."
    },
    {
      "cardId": "tpp_066",
      "sideA": {
        "conversation": [
          { "text": "Does the client know about the 'not a valid month' issue?", "audioSrc": "public/data/audio/technical_project_plan/tpp_066_a.mp3" },
          { "text": "Yes, we created a FreshService Ticket # to track the official communication with them.", "audioSrc": "public/data/audio/technical_project_plan/tpp_066_b.mp3" }
        ]
      },
      "note": "Tracking 'official communication' (Noun Phrase) with clients regarding critical bugs is essential. Using an external ticketing system (like FreshService) creates a formal record."
    },
    {
      "cardId": "tpp_067",
      "sideA": {
        "conversation": [
          { "text": "Seb, I can't reproduce the UI bug you marked as fixed.", "audioSrc": "public/data/audio/technical_project_plan/tpp_067_a.mp3" },
          { "text": "Did you clear the app's cache? Sometimes the frontend holds on to old data.", "audioSrc": "public/data/audio/technical_project_plan/tpp_067_b.mp3" }
        ]
      },
      "note": "'Cache' (Noun) is temporary storage used to speed up loading. Clearing the cache is a common first step when troubleshooting UI bugs, as it forces the app to load the very latest code and data.\n\n'Hold on to' (Phrasal Verb) means to retain."
    },
    {
      "cardId": "tpp_068",
      "sideA": {
        "conversation": [
          { "text": "At what point is the order released to AGLC?", "audioSrc": "public/data/audio/technical_project_plan/tpp_068_a.mp3" },
          { "text": "It happens after the order status changes from Entered to Booked in the backend.", "audioSrc": "public/data/audio/technical_project_plan/tpp_068_b.mp3" }
        ]
      },
      "note": "'Integration points' (Noun Phrase) are specific moments in a process where one system communicates with another. Pinpointing when these happen is key to understanding the 'business flow' (Noun)."
    },
    {
      "cardId": "tpp_069",
      "sideA": {
        "conversation": [
          { "text": "I need to understand the history of this feature.", "audioSrc": "public/data/audio/technical_project_plan/tpp_069_a.mp3" },
          { "text": "You should look through the previous Test Plans and Issue Logs from last year.", "audioSrc": "public/data/audio/technical_project_plan/tpp_069_b.mp3" }
        ]
      },
      "note": "'Look through' (Phrasal Verb) means to read or briefly examine a collection of documents. Reviewing historical project artifacts is a good way to gain context on complex features."
    },
    {
      "cardId": "tpp_070",
      "sideA": {
        "conversation": [
          { "text": "Why does the business call it a tile and not just a section?", "audioSrc": "public/data/audio/technical_project_plan/tpp_070_a.mp3" },
          { "text": "Because 'tile' implies it's a modular, self-contained block of UI, which is how it's designed in the frontend.", "audioSrc": "public/data/audio/technical_project_plan/tpp_070_b.mp3" }
        ]
      },
      "note": "The terminology used by a business team ('tile') (Noun) often reflects the underlying technical design ('modular', 'self-contained'). Understanding this language improves communication."
    },
    {
      "cardId": "tpp_071",
      "sideA": {
        "conversation": [
          { "text": "This ticket for the SK region has no developer assigned to it.", "audioSrc": "public/data/audio/technical_project_plan/tpp_071_a.mp3" },
          { "text": "You're right. Let's assign it to Sean, as he has experience with the SK-specific requirements.", "audioSrc": "public/data/audio/technical_project_plan/tpp_071_b.mp3" }
        ]
      },
      "note": "An 'unassigned' (Adjective) ticket is a risk. Assigning tasks based on a developer's specific experience or expertise is an effective project management strategy."
    },
    {
      "cardId": "tpp_072",
      "sideA": {
        "conversation": [
          { "text": "The Issue Log just says 'pricing formats have not updated'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_072_a.mp3" },
          { "text": "That's too vague. I'll ask the tester to fill in more details and provide screenshots.", "audioSrc": "public/data/audio/technical_project_plan/tpp_072_b.mp3" }
        ]
      },
      "note": "A 'vague' (Adjective) bug report is not actionable.\n\nA good bug report should always 'fill in' (Phrasal Verb) precise details and include visual evidence like 'screenshots' (Noun)."
    },
    {
      "cardId": "tpp_073",
      "sideA": {
        "conversation": [
          { "text": "The BC-FR test for Return Options has multiple FAIL entries.", "audioSrc": "public/data/audio/technical_project_plan/tpp_073_a.mp3" },
          { "text": "Yes, the button text does not fit within the UI, and the reasons are not translated. It's a complete failure.", "audioSrc": "public/data/audio/technical_project_plan/tpp_073_b.mp3" }
        ]
      },
      "note": "When a single feature has multiple, distinct points of failure (e.g., a UI layout bug and a translation bug), it indicates a more serious underlying problem in the implementation."
    },
    {
      "cardId": "tpp_074",
      "sideA": {
        "conversation": [
          { "text": "Why do we hide the prices on the Product Details page for QC only?", "audioSrc": "public/data/audio/technical_project_plan/tpp_074_a.mp3" },
          { "text": "It's a legal requirement based on Quebec's consumer protection laws.", "audioSrc": "public/data/audio/technical_project_plan/tpp_074_b.mp3" }
        ]
      },
      "note": "Understanding the 'why' behind a requirement (e.g., it's a 'legal requirement') is more important than just knowing the 'what'. It helps the team make better decisions when implementing and testing."
    },
    {
      "cardId": "tpp_075",
      "sideA": {
        "conversation": [
          { "text": "Should I start testing the checkout process?", "audioSrc": "public/data/audio/technical_project_plan/tpp_075_a.mp3" },
          { "text": "Let's hold off on that until the tax calculation bug is closed.", "audioSrc": "public/data/audio/technical_project_plan/tpp_075_b.mp3" }
        ]
      },
      "note": "'Hold off on' (Phrasal Verb) means to delay or postpone an action. This is often necessary when there is a 'dependency' (Noun) on another task."
    },
    {
      "cardId": "tpp_076",
      "sideA": {
        "conversation": [
          { "text": "The test case requires I validate the database.", "audioSrc": "public/data/audio/technical_project_plan/tpp_076_a.mp3" },
          { "text": "Correct. You need to confirm the Order Source attribute11 is correctly saved after placing an order on Android.", "audioSrc": "public/data/audio/technical_project_plan/tpp_076_b.mp3" }
        ]
      },
      "note": "'Database validation' (Noun Phrase) is a type of testing that goes beyond the UI. It involves checking the raw data in the 'database' (Noun) to ensure it was saved correctly."
    },
    {
      "cardId": "tpp_077",
      "sideA": {
        "conversation": [
          { "text": "So the user can add to the cart, but they can't book the order?", "audioSrc": "public/data/audio/technical_project_plan/tpp_077_a.mp3" },
          { "text": "Exactly. It fails at the last step, which is a very bad user experience.", "audioSrc": "public/data/audio/technical_project_plan/tpp_077_b.mp3" }
        ]
      },
      "note": "A bug that occurs late in a 'user flow' (like at the final checkout step) is considered to have a very negative impact on 'user experience' (UX) (Noun)."
    },
    {
      "cardId": "tpp_078",
      "sideA": {
        "conversation": [
          { "text": "What does the developer mean by 'rendering issue'?", "audioSrc": "public/data/audio/technical_project_plan/tpp_078_a.mp3" },
          { "text": "It means the backend is sending the correct data, but the frontend code is not displaying it correctly on the screen.", "audioSrc": "public/data/audio/technical_project_plan/tpp_078_b.mp3" }
        ]
      },
      "note": "A 'rendering issue' (Noun) is a specific type of frontend bug where the problem lies in the visual presentation of data, not the data itself. This is a key distinction in debugging."
    },
    {
      "cardId": "tpp_079",
      "sideA": {
        "conversation": [
          { "text": "How serious is the 'sleeman clear out of stock' issue?", "audioSrc": "public/data/audio/technical_project_plan/tpp_079_a.mp3" },
          { "text": "It's high priority because it's a popular product and directly impacts sales in ON.", "audioSrc": "public/data/audio/technical_project_plan/tpp_079_b.mp3" }
        ]
      },
      "note": "The 'priority' (Noun) of a bug is often determined by its business impact. Issues that directly affect 'sales' (Noun) or popular products are almost always considered high priority."
    },
    {
      "cardId": "tpp_080",
      "sideA": {
        "conversation": [
          { "text": "How should I design the test case for the Pricing Issue?", "audioSrc": "public/data/audio/technical_project_plan/tpp_080_a.mp3" },
          { "text": "You need to find a SKU that has a price change effective tomorrow, and then place the order with both today's and tomorrow's delivery date to compare.", "audioSrc": "public/data/audio/technical_project_plan/tpp_080_b.mp3" }
        ]
      },
      "note": "'Test case design' (Noun Phrase) is the art of creating tests that effectively target potential problems. Good design often involves testing 'edge cases', like a price change that happens overnight."
    },
    {
      "cardId": "tpp_081",
      "sideA": {
        "conversation": [
          { "text": "Why does the Test Plan show BC, AB, and SK tests assigned to the same people?", "audioSrc": "public/data/audio/technical_project_plan/tpp_081_a.mp3" },
          { "text": "Because those Western regions share a lot of the same business logic and can be tested together.", "audioSrc": "public/data/audio/technical_project_plan/tpp_081_b.mp3" }
        ]
      },
      "note": "A 'Test Plan strategy' (Noun Phrase) often involves grouping tests for regions or features that share common 'business logic' (Noun). This is an efficient way to manage testing resources."
    },
    {
      "cardId": "tpp_082",
      "sideA": {
        "conversation": [
          { "text": "The status report is too high-level.", "audioSrc": "public/data/audio/technical_project_plan/tpp_082_a.mp3" },
          { "text": "Okay, let's drill down into the Issue Log and look at the open tickets for Android specifically.", "audioSrc": "public/data/audio/technical_project_plan/tpp_082_b.mp3" }
        ]
      },
      "note": "'Drill down into' (Phrasal Verb) means to investigate something at a deeper, more detailed level. This is the opposite of a 'high-level' (Adjective) view."
    },
    {
      "cardId": "tpp_083",
      "sideA": {
        "conversation": [
          { "text": "Why can't we just show the Ecofee separately? It would be clearer.", "audioSrc": "public/data/audio/technical_project_plan/tpp_083_a.mp3" },
          { "text": "There's a technical constraint. The Oracle EBS backend combines it into the Sub-Total before sending the data to us.", "audioSrc": "public/data/audio/technical_project_plan/tpp_083_b.mp3" }
        ]
      },
      "note": "A 'technical constraint' (Noun) is a limitation imposed by the technology being used. It can prevent the implementation of a feature even if it's a good idea from a user's perspective."
    },
    {
      "cardId": "tpp_084",
      "sideA": {
        "conversation": [
          { "text": "I need to run a negative test. What should happen?", "audioSrc": "public/data/audio/technical_project_plan/tpp_084_a.mp3" },
          { "text": "You should try to place the order with a quantity of zero. The system should give you an error and you should be prevented from doing so.", "audioSrc": "public/data/audio/technical_project_plan/tpp_084_b.mp3" }
        ]
      },
      "note": "A 'negative test case' (Noun) is designed to verify that the system correctly handles invalid input or error conditions. This is just as important as testing the 'happy path'."
    },
    {
      "cardId": "tpp_085",
      "sideA": {
        "conversation": [
          { "text": "I'm testing QC-EN. Should the Legal Note for the Ecofee be in English?", "audioSrc": "public/data/audio/technical_project_plan/tpp_085_a.mp3" },
          { "text": "Yes. And when you switch the profile to QC-FR, it must appear as รcofrais in French.", "audioSrc": "public/data/audio/technical_project_plan/tpp_085_b.mp3" }
        ]
      },
      "note": "Testing localization requires checking both language and region combinations (like QC-EN for Quebec-English). Content must adapt correctly when the user switches profiles."
    },
    {
      "cardId": "tpp_086",
      "sideA": {
        "conversation": [
          { "text": "We haven't heard from the developer on Issue #20.", "audioSrc": "public/data/audio/technical_project_plan/tpp_086_a.mp3" },
          { "text": "I will follow up with Seb after this meeting to get a status update.", "audioSrc": "public/data/audio/technical_project_plan/tpp_086_b.mp3" }
        ]
      },
      "note": "'Follow up with' (Phrasal Verb) means to contact someone to get more information or to ensure a task is progressing. It's a key action in project communication."
    },
    {
      "cardId": "tpp_087",
      "sideA": {
        "conversation": [
          { "text": "Why is it so important to test the 'switch customer' feature?", "audioSrc": "public/data/audio/technical_project_plan/tpp_087_a.mp3" },
          { "text": "Because our Sales Rep Profile users manage hundreds of customers and need to place orders for them quickly.", "audioSrc": "public/data/audio/technical_project_plan/tpp_087_b.mp3" }
        ]
      },
      "note": "The importance of a feature is often tied to the specific needs of a key user 'profile' (Noun). Understanding the user's workflow justifies the testing effort."
    },
    {
      "cardId": "tpp_088",
      "sideA": {
        "conversation": [
          { "text": "Have we performed an 'end-to-end' test for a new customer?", "audioSrc": "public/data/audio/technical_project_plan/tpp_088_a.mp3" },
          { "text": "Good question. We need a test case that covers everything from log in, to add to cart, to place the order, and finally validating the invoice.", "audioSrc": "public/data/audio/technical_project_plan/tpp_088_b.mp3" }
        ]
      },
      "note": "An 'end-to-end' (Adjective) test simulates a complete user journey from start to finish. It's crucial for validating that all parts of the system work together correctly."
    },
    {
      "cardId": "tpp_089",
      "sideA": {
        "conversation": [
          { "text": "The developer says the requirement is different from what I'm testing.", "audioSrc": "public/data/audio/technical_project_plan/tpp_089_a.mp3" },
          { "text": "The Test Plan and its Test Cases are the 'source of truth'. We must follow what is written there.", "audioSrc": "public/data/audio/technical_project_plan/tpp_089_b.mp3" }
        ]
      },
      "note": "The 'source of truth' (Idiom) is the single, authoritative document or system that everyone agrees to follow. In testing, this is typically the Test Plan or requirements document."
    },
    {
      "cardId": "tpp_090",
      "sideA": {
        "conversation": [
          { "text": "Does it matter if the Ecofee tile is to the left or right of the Total Price?", "audioSrc": "public/data/audio/technical_project_plan/tpp_090_a.mp3" },
          { "text": "Yes, the UI design in the requirement specifically says 'to the left'. It's a FAIL if it's not.", "audioSrc": "public/data/audio/technical_project_plan/tpp_090_b.mp3" }
        ]
      },
      "note": "Small details in the 'UI design' (Noun) can be strict requirements. Testers must validate pixel-perfect compliance when specified, as even minor layout deviations can be considered a 'FAIL' (Noun)."
    },
    {
      "cardId": "tpp_091",
      "sideA": {
        "conversation": [
          { "text": "Can I submit a return for multiple items with different Return Reasons?", "audioSrc": "public/data/audio/technical_project_plan/tpp_091_a.mp3" },
          { "text": "That's a great test case. The Issue Log shows that filling in details for multiple items is currently broken.", "audioSrc": "public/data/audio/technical_project_plan/tpp_091_b.mp3" }
        ]
      },
      "note": "Testing complex scenarios, like submitting forms with 'multiple items' (Noun Phrase), is a great way to find bugs that simpler test cases might miss."
    },
    {
      "cardId": "tpp_092",
      "sideA": {
        "conversation": [
          { "text": "Why did the UAT tester fail this ticket?", "audioSrc": "public/data/audio/technical_project_plan/tpp_092_a.mp3" },
          { "text": "Because even though it worked technically, they found the Business Flow confusing.", "audioSrc": "public/data/audio/technical_project_plan/tpp_092_b.mp3" }
        ]
      },
      "note": "'UAT' (User Acceptance Testing) (Noun) can fail a ticket not just for technical bugs, but also for usability issues. If the 'Business Flow' (Noun) is confusing, it's a valid reason for failure."
    },
    {
      "cardId": "tpp_093",
      "sideA": {
        "conversation": [
          { "text": "If I update an order in the iStore webapp, does it sync with the mobile app's Shopping Cart?", "audioSrc": "public/data/audio/technical_project_plan/tpp_093_a.mp3" },
          { "text": "No, they are separate sessions. The 'source of truth' is always the EBS backend.", "audioSrc": "public/data/audio/technical_project_plan/tpp_093_b.mp3" }
        ]
      },
      "note": "Understanding how data is 'synced' (or not synced) between different platforms (webapp vs. mobile) is a key architectural point.\n\nA 'session' (Noun) is a single, temporary interaction with the app."
    },
    {
      "cardId": "tpp_094",
      "sideA": {
        "conversation": [
          { "text": "Are we ready to release this new version?", "audioSrc": "public/data/audio/technical_project_plan/tpp_094_a.mp3" },
          { "text": "Not until the business manager can sign off on the UAT results.", "audioSrc": "public/data/audio/technical_project_plan/tpp_094_b.mp3" }
        ]
      },
      "note": "'Sign off on' (Phrasal Verb) means to give formal approval. Getting sign-off from key stakeholders (like a business manager) on test results is a critical gate before a 'release' (Noun)."
    },
    {
      "cardId": "tpp_095",
      "sideA": {
        "conversation": [
          { "text": "What is a 'showstopper' bug?", "audioSrc": "public/data/audio/technical_project_plan/tpp_095_a.mp3" },
          { "text": "It's a critical issue, like the 'not a valid month' bug, that is so severe it stops the entire release. It must be fixed.", "audioSrc": "public/data/audio/technical_project_plan/tpp_095_b.mp3" }
        ]
      },
      "note": "A 'showstopper' (Idiom/Noun) is a bug of the highest possible severity. It's a synonym for a critical 'blocker' that prevents a software release from happening."
    },
    {
      "cardId": "tpp_096",
      "sideA": {
        "conversation": [
          { "text": "I can't connect to the Oracle EBS SOA URL.", "audioSrc": "public/data/audio/technical_project_plan/tpp_096_a.mp3" },
          { "text": "Let's check the firewall rules. Your IP address might need to be whitelisted to access that endpoint.", "audioSrc": "public/data/audio/technical_project_plan/tpp_096_b.mp3" }
        ]
      },
      "note": "Connection issues to internal 'endpoints' (Noun) are often related to security. A 'firewall' (Noun) blocks traffic, and your IP address may need to be 'whitelisted' (Verb) to be granted access."
    },
    {
      "cardId": "tpp_097",
      "sideA": {
        "conversation": [
          { "text": "The Total Adjustment calculation seems wrong.", "audioSrc": "public/data/audio/technical_project_plan/tpp_097_a.mp3" },
          { "text": "Let's calculate it manually. It should be the Discount subtracted from the Ecofee.", "audioSrc": "public/data/audio/technical_project_plan/tpp_097_b.mp3" }
        ]
      },
      "note": "When a calculation seems wrong, the first step is to verify the formula and 'calculate it manually' (Verb Phrase). This helps determine if the issue is in the code or the logic."
    },
    {
      "cardId": "tpp_098",
      "sideA": {
        "conversation": [
          { "text": "The ticket title is 'Fridge Mobile - Pricing Issue / Pricing Date'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_098_a.mp3" },
          { "text": "This indicates the ticket is solving two related problems: a general pricing bug and the specific logic for pricing date.", "audioSrc": "public/data/audio/technical_project_plan/tpp_098_b.mp3" }
        ]
      },
      "note": "The 'title' (Noun) of a ticket is important. A forward slash (/) is often used to indicate that a single ticket addresses multiple, closely related sub-issues."
    },
    {
      "cardId": "tpp_099",
      "sideA": {
        "conversation": [
          { "text": "Before we deploy, can someone do a quick 'sanity check' on the ON production URL?", "audioSrc": "public/data/audio/technical_project_plan/tpp_099_a.mp3" },
          { "text": "Good idea. I'll just place an order with a test account to make sure the core functionality is working.", "audioSrc": "public/data/audio/technical_project_plan/tpp_099_b.mp3" }
        ]
      },
      "note": "A 'sanity check' (Idiom/Noun) is a brief, high-level test to ensure that the core functionality of a system is working after a change. It's not exhaustive, but it catches major problems."
    },
    {
      "cardId": "tpp_100",
      "sideA": {
        "conversation": [
          { "text": "Okay, so to wrap up, what are our action items?", "audioSrc": "public/data/audio/technical_project_plan/tpp_100_a.mp3" },
          { "text": "Seb will deal with the priority bugs, and the testers will go through the Retest column in the Issue Log.", "audioSrc": "public/data/audio/technical_project_plan/tpp_100_b.mp3" }
        ]
      },
      "note": "'Wrap up' (Phrasal Verb) means to conclude or finish something, like a meeting.\n\nDefining clear 'action items' (Noun) is the most important outcome of any project meeting."
    },
    {
    "cardId": "tpp_101",
    "sideA": {
      "conversation": [
        { "text": "The customer selected 'Keg Foamy' as the Return Reason.", "audioSrc": "public/data/audio/technical_project_plan/tpp_101_a.mp3" },
        { "text": "I see. Let's check their Order History to see if this is a recurring issue with that Account.", "audioSrc": "public/data/audio/technical_project_plan/tpp_101_b.mp3" }
      ]
    },
    "note": "'Return Reason' (Noun) is the specific cause a customer gives for returning an item.\n\n'Keg Foamy' (Adjective Phrase) is a return reason indicating that a keg dispenses beer with too much foam.\n\n'Order History' (Noun) is a record of a customer's past purchases."
  },
  {
    "cardId": "tpp_102",
    "sideA": {
      "conversation": [
        { "text": "On the Checkout page, the tax for British Columbia isn't showing up.", "audioSrc": "public/data/audio/technical_project_plan/tpp_102_a.mp3" },
        { "text": "Right, that's a known bug: 'Taxes doesn't show value'. We need to make sure the CA_PST is applied correctly.", "audioSrc": "public/data/audio/technical_project_plan/tpp_102_b.mp3" }
      ]
    },
    "note": "'Checkout' (Noun) is the final phase of an online purchase, where payment and delivery details are confirmed.\n\n'CA_PST' (Provincial Sales Tax) is a sales tax applied by a specific province in Canada."
  },
  {
    "cardId": "tpp_103",
    "sideA": {
      "conversation": [
        { "text": "CSRs are reporting that the 'Add to Cart' button is unresponsive on some LTO items.", "audioSrc": "public/data/audio/technical_project_plan/tpp_103_a.mp3" },
        { "text": "I'll investigate. It might be an issue with how the Availability status is being handled for limited offers.", "audioSrc": "public/data/audio/technical_project_plan/tpp_103_b.mp3" }
      ]
    },
    "note": "'Add to Cart' (Verb Phrase) is the action of selecting a product to be purchased.\n\n'LTO' (Limited Time Offer) (Noun) is a product that is for sale for a short period only.\n\n'Availability' (Noun) is a status that indicates if a product is in stock and can be sold."
  },
  {
    "cardId": "tpp_104",
    "sideA": {
      "conversation": [
        { "text": "I can't find the order. Do you have the PO Number?", "audioSrc": "public/data/audio/technical_project_plan/tpp_104_a.mp3" },
        { "text": "Yes, it's 5507. It's for the 'REAL CANADIAN LIQUOR STORE' account.", "audioSrc": "public/data/audio/technical_project_plan/tpp_104_b.mp3" }
      ]
    },
    "note": "'PO Number' (Purchase Order Number) (Noun) is a unique number assigned to a purchase order form, used to track orders.\n\n'Account' (Noun) is a record of a specific customer or business entity."
  },
  {
    "cardId": "tpp_105",
    "sideA": {
      "conversation": [
        { "text": "The return reason is 'Stale dated', but the system is logging it as 'Breakage'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_105_a.mp3" },
        { "text": "Okay, that's a mapping error. I'll create a ticket to fix the logic for Return Items.", "audioSrc": "public/data/audio/technical_project_plan/tpp_105_b.mp3" }
      ]
    },
    "note": "'Stale dated' (Adjective Phrase) is a reason for return, meaning the product is past its expiration date.\n\n'Breakage' (Noun) is a return reason for items that were physically broken.\n\n'Return Items' (Noun Phrase) refers to the feature or process for sending products back."
  },
  {
    "cardId": "tpp_106",
    "sideA": {
      "conversation": [
        { "text": "The 'Select All' checkbox isn't working on the Invoices screen.", "audioSrc": "public/data/audio/technical_project_plan/tpp_106_a.mp3" },
        { "text": "Is 'Select None' working? Let's test the Radio buttons on that page as well.", "audioSrc": "public/data/audio/technical_project_plan/tpp_106_b.mp3" }
      ]
    },
    "note": "'Select All' (Verb Phrase) is an option to choose every item in a list.\n\n'Invoice(s)' (Noun) are the billing documents for orders.\n\n'Radio button' (Noun) is a UI element that allows a user to choose only one option from a set."
  },
  {
    "cardId": "tpp_107",
    "sideA": {
      "conversation": [
        { "text": "The customer wants to know the Deposit amount for a keg of Sapporo.", "audioSrc": "public/data/audio/technical_project_plan/tpp_107_a.mp3" },
        { "text": "Check the Product details page. The Deposit should be listed next to the Price.", "audioSrc": "public/data/audio/technical_project_plan/tpp_107_b.mp3" }
      ]
    },
    "note": "'Deposit' (Noun) is a refundable security payment required for certain items, like kegs.\n\n'Sapporo' (Noun) is a specific brand of beer.\n\n'Price' (Noun) is the cost of an individual item."
  },
  {
    "cardId": "tpp_108",
    "sideA": {
      "conversation": [
        { "text": "The search function is too slow when you don't 'Enter CSPC Number'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_108_a.mp3" },
        { "text": "We need to optimize the query. Searching by 'Product' name is taking too long.", "audioSrc": "public/data/audio/technical_project_plan/tpp_108_b.mp3" }
      ]
    },
    "note": "'CSPC (Number)' (Noun) is a unique product identification code, likely the Canadian Standard Product Code.\n\n'Product(s)' (Noun) refers to the goods available for sale."
  },
  {
    "cardId": "tpp_109",
    "sideA": {
      "conversation": [
        { "text": "This ticket is for a 'Defective Keg'. What are the steps to reproduce?", "audioSrc": "public/data/audio/technical_project_plan/tpp_109_a.mp3" },
        { "text": "The user reported that after adding it to the cart and proceeding to checkout, the system crashed.", "audioSrc": "public/data/audio/technical_project_plan/tpp_109_b.mp3" }
      ]
    },
    "note": "'Defective Keg' (Noun Phrase) is a return reason for a keg that is faulty or does not work correctly.\n\n'Steps to reproduce' (Noun Phrase) are the instructions needed to reliably trigger a specific bug or issue."
  },
  {
    "cardId": "tpp_110",
    "sideA": {
      "conversation": [
        { "text": "In the Order detail view, the 'Shipping and Handling' fee is missing.", "audioSrc": "public/data/audio/technical_project_plan/tpp_110_a.mp3" },
        { "text": "I'll check. The 'Cost of Service' is also not appearing. It seems the whole fee section is bugged.", "audioSrc": "public/data/audio/technical_project_plan/tpp_110_b.mp3" }
      ]
    },
    "note": "'Shipping and Handling' (Noun) is a fee for the cost of processing and delivering an order.\n\n'Order detail' (Noun Phrase) is the screen that shows all the information for a single order.\n\n'Cost of Service' (Noun) is an additional fee for services provided with a purchase."
  },
  {
    "cardId": "tpp_111",
    "sideA": {
      "conversation": [
        { "text": "The 'Keg Broken Seal' return reason isn't available for selection in Quebec.", "audioSrc": "public/data/audio/technical_project_plan/tpp_111_a.mp3" },
        { "text": "That's by design. The business rules for QC are different. Check the 'Preferences' for that region.", "audioSrc": "public/data/audio/technical_project_plan/tpp_111_b.mp3" }
      ]
    },
    "note": "'Keg Broken Seal' (Noun Phrase) is a return reason for a keg with a compromised security seal.\n\n'Quebec' (QC) (Noun) is a province in Canada.\n\n'Preferences' (Noun) are user-configurable or region-specific settings."
  },
  {
    "cardId": "tpp_112",
    "sideA": {
      "conversation": [
        { "text": "I can't save my 'Favorites'. When I log out and log back in, they're gone.", "audioSrc": "public/data/audio/technical_project_plan/tpp_112_a.mp3" },
        { "text": "Sounds like the session data isn't being saved to the Profile correctly. I'll debug the Logout process.", "audioSrc": "public/data/audio/technical_project_plan/tpp_112_b.mp3" }
      ]
    },
    "note": "'Favorites' (Noun) is a section where users can save preferred items for easy access.\n\n'Logout' (Verb) is the action of signing out of an application.\n\n'Profile' (Noun) is the user's personal account section."
  },
  {
    "cardId": "tpp_113",
    "sideA": {
      "conversation": [
        { "text": "Let's check the 'New Releases' banner. Does it link to the correct product list?", "audioSrc": "public/data/audio/technical_project_plan/tpp_113_a.mp3" },
        { "text": "Yes, clicking the 'Discover the Unexpected' slogan takes you to the new items page.", "audioSrc": "public/data/audio/technical_project_plan/tpp_113_b.mp3" }
      ]
    },
    "note": "'New Releases' (Noun) is a category for newly available products.\n\n'Banner' (Noun) is a large on-screen advertisement or informational graphic."
  },
  {
    "cardId": "tpp_114",
    "sideA": {
      "conversation": [
        { "text": "The 'Bill To' address is not being populated from the customer's Personal Information.", "audioSrc": "public/data/audio/technical_project_plan/tpp_114_a.mp3" },
        { "text": "Is the 'Fill Details' button present? The user should be able to click it to auto-populate the form.", "audioSrc": "public/data/audio/technical_project_plan/tpp_114_b.mp3" }
      ]
    },
    "note": "'Bill To' (Noun Phrase) refers to the billing address for an invoice.\n\n'Personal Information' (Noun) are user-specific details like name and address.\n\n'Fill Details' (Verb Phrase) is an action to automatically populate required fields."
  },
  {
    "cardId": "tpp_115",
    "sideA": {
      "conversation": [
        { "text": "The total tax calculated for Saskatchewan seems incorrect.", "audioSrc": "public/data/audio/technical_project_plan/tpp_115_a.mp3" },
        { "text": "That's the 'Taxes doesn't match value' bug. The CA_GST rate is wrong for SK.", "audioSrc": "public/data/audio/technical_project_plan/tpp_115_b.mp3" }
      ]
    },
    "note": "'Saskatchewan' (SK) (Noun) is a province in Canada.\n\n'CA_GST' (Goods and Services Tax) is a federal sales tax in Canada."
  },
  {
    "cardId": "tpp_116",
    "sideA": {
      "conversation": [
        { "text": "The user wants to return an item for a reason not listed. What should they do?", "audioSrc": "public/data/audio/technical_project_plan/tpp_116_a.mp3" },
        { "text": "They should select 'Other' from the dropdown and describe the issue in the comments field.", "audioSrc": "public/data/audio/technical_project_plan/tpp_116_b.mp3" }
      ]
    },
    "note": "'Other' (Noun) is a generic option in a list, used for reasons not explicitly listed.\n\n'Dropdown' (Noun) is a UI element that presents a list of options when clicked."
  },
  {
    "cardId": "tpp_117",
    "sideA": {
      "conversation": [
        { "text": "What's the UOM for a case of Pabst Blue Ribbon?", "audioSrc": "public/data/audio/technical_project_plan/tpp_117_a.mp3" },
        { "text": "The Unit of Measure is 'Cs'. The Shipping Format is 'Can'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_117_b.mp3" }
      ]
    },
    "note": "'UOM' (Unit of Measure) (Noun) is the standard unit for an item (e.g., 'Cs' for case).\n\n'Pabst Blue Ribbon' (Noun) is a specific brand of beer.\n\n'Shipping Format' (Noun) is the type of packaging for delivery."
  },
  {
    "cardId": "tpp_118",
    "sideA": {
      "conversation": [
        { "text": "The 'Net Price' is correct, but the 'Sub-Total' is not updating when I change the Quantity.", "audioSrc": "public/data/audio/technical_project_plan/tpp_118_a.mp3" },
        { "text": "Let's check the front-end script that recalculates the Cart total. The event listener might be broken.", "audioSrc": "public/data/audio/technical_project_plan/tpp_118_b.mp3" }
      ]
    },
    "note": "'Net Price' (Noun) is the final price of an item after all adjustments and discounts.\n\n'Sub-Total' (Noun) is the total cost of all items before taxes and fees.\n\n'Quantity' (Noun) is the number of units of an item."
  },
  {
    "cardId": "tpp_119",
    "sideA": {
      "conversation": [
        { "text": "When the 'Open Credit Available' is zero, the Payments section should be disabled.", "audioSrc": "public/data/audio/technical_project_plan/tpp_119_a.mp3" },
        { "text": "Good point. I'll add a condition to the UI to grey out the 'Payments' button in that case.", "audioSrc": "public/data/audio/technical_project_plan/tpp_119_b.mp3" }
      ]
    },
    "note": "'Open Credit Available' (Noun Phrase) is the amount of credit a customer has available to use.\n\n'Payments' (Noun) is the application section for managing and viewing payment information."
  },
  {
    "cardId": "tpp_120",
    "sideA": {
      "conversation": [
        { "text": "We need a 'Calender' icon next to the 'Date' field for delivery selection.", "audioSrc": "public/data/audio/technical_project_plan/tpp_120_a.mp3" },
        { "text": "Agreed. I'll add the icon and hook it up to a date picker component. That's a quick UI fix.", "audioSrc": "public/data/audio/technical_project_plan/tpp_120_b.mp3" }
      ]
    },
    "note": "'Calender' (Noun, common typo for Calendar) refers to the icon used for selecting dates.\n\n'Date' (Noun) refers to a specific day, often for an order or delivery."
  },
  {
    "cardId": "tpp_121",
    "sideA": {
      "conversation": [
        { "text": "The bug report says, 'Mobile doesn't show info' for the 'Order details'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_121_a.mp3" },
        { "text": "It seems the API response is not being parsed correctly on smaller screens. Let's check the Javascript.", "audioSrc": "public/data/audio/technical_project_plan/tpp_121_b.mp3" }
      ]
    },
    "note": "'Mobile doesn't show info' (Bug Description) is a user-reported problem where data fails to appear on mobile devices.\n\n'API response' (Noun) is the data sent back from a server after a request is made."
  },
  {
    "cardId": "tpp_122",
    "sideA": {
      "conversation": [
        { "text": "The bug 'Pricing details lack info' seems to be specific to Alberta.", "audioSrc": "public/data/audio/technical_project_plan/tpp_122_a.mp3" },
        { "text": "Yes, the CA_HST logic for AB is not returning the tax breakdown. It works for Ontario.", "audioSrc": "public/data/audio/technical_project_plan/tpp_122_b.mp3" }
      ]
    },
    "note": "'Pricing details lack info' (Bug Description) is a problem where price breakdowns are incomplete or missing.\n\n'Alberta' (AB) (Noun) is a province in Canada.\n\n'CA_HST' (Harmonized Sales Tax) is a combined federal and provincial sales tax."
  },
  {
    "cardId": "tpp_123",
    "sideA": {
      "conversation": [
        { "text": "Let's use the 'Back Arrow' to navigate from the 'Profile' page to the 'Dashboard'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_123_a.mp3" },
        { "text": "Sounds good. That's a standard navigation pattern and users will expect it.", "audioSrc": "public/data/audio/technical_project_plan/tpp_123_b.mp3" }
      ]
    },
    "note": "'Back Arrow' (Noun) is a UI icon used to navigate to the previous screen.\n\n'Dashboard' (Noun) is the main home screen of the application after login."
  },
  {
    "cardId": "tpp_124",
    "sideA": {
      "conversation": [
        { "text": "The dev note says 'In Purple works better'. What does 'Purple' mean?", "audioSrc": "public/data/audio/technical_project_plan/tpp_124_a.mp3" },
        { "text": "Purple is the code name for our UAT (User Acceptance Testing) environment. It means the bug is fixed there.", "audioSrc": "public/data/audio/technical_project_plan/tpp_124_b.mp3" }
      ]
    },
    "note": "'In Purple works better' (Developer Note) indicates a feature functions correctly in the UAT or staging environment, which is internally nicknamed 'Purple'.\n\n'UAT' (User Acceptance Testing) is the final phase of testing where actual users test the software."
  },
  {
    "cardId": "tpp_125",
    "sideA": {
      "conversation": [
        { "text": "The marketing slogan 'Less Mixing. More Mingling.' is not fitting within the button.", "audioSrc": "public/data/audio/technical_project_plan/tpp_125_a.mp3" },
        { "text": "That's a UI bug. We'll need to adjust the font size or the button padding for that text.", "audioSrc": "public/data/audio/technical_project_plan/tpp_125_b.mp3" }
      ]
    },
    "note": "'not fitting within button' (UI Bug Description) means a text label is too long for the visible area of the button it's on.\n\n'Padding' (Noun) is the space between the content (like text) and the border of an element (like a button)."
  },
  {
    "cardId": "tpp_126",
    "sideA": {
      "conversation": [
        { "text": "The customer clicked 'Cancel' during 'Checkout', but the order was still processed.", "audioSrc": "public/data/audio/technical_project_plan/tpp_126_a.mp3" },
        { "text": "That's a critical bug. The cancel action should terminate the transaction and empty the Cart.", "audioSrc": "public/data/audio/technical_project_plan/tpp_126_b.mp3" }
      ]
    },
    "note": "'Cancel' (Verb) is an action to stop a process that is currently in progress.\n\n'Cart' (Noun) is the virtual shopping basket where items are held before purchase."
  },
  {
    "cardId": "tpp_127",
    "sideA": {
      "conversation": [
        { "text": "I need to delete this 'Saved Cart'. How do I do that?", "audioSrc": "public/data/audio/technical_project_plan/tpp_127_a.mp3" },
        { "text": "Go to the Saved Cart screen and there should be a 'Delete' icon next to each one.", "audioSrc": "public/data/audio/technical_project_plan/tpp_127_b.mp3" }
      ]
    },
    "note": "'Saved Cart' (Noun) is a feature that allows a user to save the contents of their cart for a future session.\n\n'Delete' (Verb) is an action to permanently remove an item or data."
  },
  {
    "cardId": "tpp_128",
    "sideA": {
      "conversation": [
        { "text": "When I click the 'Magnifying glass' icon, I want to search by Customer Name.", "audioSrc": "public/data/audio/technical_project_plan/tpp_128_a.mp3" },
        { "text": "Currently, the 'Search' function only supports SKU. We can add this as a new feature.", "audioSrc": "public/data/audio/technical_project_plan/tpp_128_b.mp3" }
      ]
    },
    "note": "'Magnifying glass' (Noun) is the common UI icon that represents a search function.\n\n'Customer Name' (Noun) is the name of the client making the order.\n\n'SKU' (Stock Keeping Unit) is a unique code to identify a product."
  },
  {
    "cardId": "tpp_129",
    "sideA": {
      "conversation": [
        { "text": "The dropdown shows 'Please Select' even after I choose a Delivery Format.", "audioSrc": "public/data/audio/technical_project_plan/tpp_129_a.mp3" },
        { "text": "It sounds like the UI state isn't updating after the 'Select' action. I'll look into it.", "audioSrc": "public/data/audio/technical_project_plan/tpp_129_b.mp3" }
      ]
    },
    "note": "'Please Select' (Instructional Text) is the default text in a dropdown menu, prompting the user to make a choice.\n\n'Delivery Format' (Noun) is the packaging style of a product for shipping (e.g., Bottle, Keg)."
  },
  {
    "cardId": "tpp_130",
    "sideA": {
      "conversation": [
        { "text": "We need to show a 'Warning' message if a user tries to order more than their available credit.", "audioSrc": "public/data/audio/technical_project_plan/tpp_130_a.mp3" },
        { "text": "Yes, a dialog box with an 'OK' button should appear, explaining the issue.", "audioSrc": "public/data/audio/technical_project_plan/tpp_130_b.mp3" }
      ]
    },
    "note": "'Warning' (Noun) is a message that alerts the user to a potential issue or error.\n\n'OK' (Button Label) is a button used to acknowledge a message or confirm an action."
  },
  {
    "cardId": "tpp_131",
    "sideA": {
      "conversation": [
        { "text": "The 'Item number' for Sleeman is wrong in the staging database.", "audioSrc": "public/data/audio/technical_project_plan/tpp_131_a.mp3" },
        { "text": "Okay, I will update the product data. We need to make sure it's correct before we 'Submit' the changes to production.", "audioSrc": "public/data/audio/technical_project_plan/tpp_131_b.mp3" }
      ]
    },
    "note": "'Item number' (Noun) is a unique identifier for a product.\n\n'Sleeman' (Noun) is the brand name of the company.\n\n'Submit' (Verb) means to confirm and send data or a form."
  },
  {
    "cardId": "tpp_132",
    "sideA": {
      "conversation": [
        { "text": "The 'Total' on the invoice for the customer in British Columbia is wrong.", "audioSrc": "public/data/audio/technical_project_plan/tpp_132_a.mp3" },
        { "text": "It's likely the 'Rate' for the provincial tax (PST) is misconfigured for 'British' accounts.", "audioSrc": "public/data/audio/technical_project_plan/tpp_132_b.mp3" }
      ]
    },
    "note": "'Total' (Noun) is the final, complete cost of an order.\n\n'Rate' (Noun) is the percentage value of a tax.\n\n'British' (Adjective) is used here as a shorthand reference for the province of British Columbia."
  },
  {
    "cardId": "tpp_133",
    "sideA": {
      "conversation": [
        { "text": "After a successful payment, the user should be redirected to the Home screen.", "audioSrc": "public/data/audio/technical_project_plan/tpp_133_a.mp3" },
        { "text": "Right now, it just shows a 'Success' message but stays on the payments page. I'll fix the redirect.", "audioSrc": "public/data/audio/technical_project_plan/tpp_133_b.mp3" }
      ]
    },
    "note": "'Home' (Noun) refers to the main screen or dashboard of the application.\n\n'Success' (Noun) is a status message indicating that an operation has completed correctly."
  },
  {
    "cardId": "tpp_134",
    "sideA": {
      "conversation": [
        { "text": "The menu is not collapsing properly on mobile devices after Login.", "audioSrc": "public/data/audio/technical_project_plan/tpp_134_a.mp3" },
        { "text": "Let me check the CSS. The hamburger menu's state change is probably not firing.", "audioSrc": "public/data/audio/technical_project_plan/tpp_134_b.mp3" }
      ]
    },
    "note": "'Menu' (Noun) is a list of navigation options or sections in the application.\n\n'Login' (Noun/Verb) is the action or process of accessing a user account."
  },
  {
    "cardId": "tpp_135",
    "sideA": {
      "conversation": [
        { "text": "I can't apply the filter for 'Available' items only in the product list.", "audioSrc": "public/data/audio/technical_project_plan/tpp_135_a.mp3" },
        { "text": "I see the 'Apply' button, but clicking it does nothing. I'll assign this bug to the front-end team.", "audioSrc": "public/data/audio/technical_project_plan/tpp_135_b.mp3" }
      ]
    },
    "note": "'Available' (Adjective) describes an item that is ready for purchase or in stock.\n\n'Apply' (Verb) is the action to confirm and use a selected setting or filter."
  },
  {
    "cardId": "tpp_136",
    "sideA": {
      "conversation": [
        { "text": "The customer selected 'Keg Moldy' as a return reason.", "audioSrc": "public/data/audio/technical_project_plan/tpp_136_a.mp3" },
        { "text": "We need to flag this for quality control. This is a serious product issue.", "audioSrc": "public/data/audio/technical_project_plan/tpp_136_b.mp3" }
      ]
    },
    "note": "'Keg Moldy' (Adjective Phrase) is a return reason indicating that mold was present on or in the keg.\n\n'Quality Control' (QC) (Noun) is the process of ensuring that products meet a certain standard of quality."
  },
  {
    "cardId": "tpp_137",
    "sideA": {
      "conversation": [
        { "text": "The prompt 'Select Item(s) and...' is confusing. And what?", "audioSrc": "public/data/audio/technical_project_plan/tpp_137_a.mp3" },
        { "text": "It should be followed by a dropdown of actions, like 'Add to Favorites' or 'Return Items'. The dropdown is missing.", "audioSrc": "public/data/audio/technical_project_plan/tpp_137_b.mp3" }
      ]
    },
    "note": "'Select Item(s) and...' (Instructional Text) is a prompt indicating that an action can be applied to the items the user has chosen."
  },
  {
    "cardId": "tpp_138",
    "sideA": {
      "conversation": [
        { "text": "The 'Delivery Format' for this item is 'Can', which is correct.", "audioSrc": "public/data/audio/technical_project_plan/tpp_138_a.mp3" },
        { "text": "Okay, but the product image shows a bottle. Let's fix the image to avoid confusion.", "audioSrc": "public/data/audio/technical_project_plan/tpp_138_b.mp3" }
      ]
    },
    "note": "'Can' (Noun) is a type of drink container, typically made of aluminum.\n\n'Delivery Format' (Noun) specifies the packaging style of a product for shipping."
  },
  {
    "cardId": "tpp_139",
    "sideA": {
      "conversation": [
        { "text": "A CSR needs to be able to look up an order using the SKU from the customer's invoice.", "audioSrc": "public/data/audio/technical_project_plan/tpp_139_a.mp3" },
        { "text": "We can add SKU to the main search bar on the dashboard for CSR users.", "audioSrc": "public/data/audio/technical_project_plan/tpp_139_b.mp3" }
      ]
    },
    "note": "'CSR' (Customer Service Representative) is a person who helps customers with orders, questions, and issues.\n\n'SKU' (Stock Keeping Unit) is a unique code for tracking a specific product."
  },
  {
    "cardId": "tpp_140",
    "sideA": {
      "conversation": [
        { "text": "When an item is returned for 'Breakage', does it go back into inventory?", "audioSrc": "public/data/audio/technical_project_plan/tpp_140_a.mp3" },
        { "text": "No, the process for 'Breakage' should write it off as a loss and not update the stock quantity.", "audioSrc": "public/data/audio/technical_project_plan/tpp_140_b.mp3" }
      ]
    },
    "note": "'Breakage' (Noun) is a return reason for an item that was broken.\n\n'Inventory' (Noun) refers to the stock of goods a company has on hand."
  },
  {
    "cardId": "tpp_141",
    "sideA": {
      "conversation": [
        { "text": "The sub-total is correct, but the final total is wrong for orders in Ontario.", "audioSrc": "public/data/audio/technical_project_plan/tpp_141_a.mp3" },
        { "text": "It must be the CA_HST calculation. Let's verify the tax rate for ON is correct in the config.", "audioSrc": "public/data/audio/technical_project_plan/tpp_141_b.mp3" }
      ]
    },
    "note": "'Ontario' (ON) (Noun) is a province in Canada.\n\n'CA_HST' (Harmonized Sales Tax) is a sales tax that combines federal and provincial taxes into one."
  },
  {
    "cardId": "tpp_142",
    "sideA": {
      "conversation": [
        { "text": "When I select an item, I want to see the 'Net Price' immediately.", "audioSrc": "public/data/audio/technical_project_plan/tpp_142_a.mp3" },
        { "text": "Currently it only shows the base 'Price'. We need to apply customer-specific discounts to show the Net Price.", "audioSrc": "public/data/audio/technical_project_plan/tpp_142_b.mp3" }
      ]
    },
    "note": "'Net Price' (Noun) is the final price after all discounts have been applied.\n\n'Price' (Noun) is the standard cost of an item before any adjustments."
  },
  {
    "cardId": "tpp_143",
    "sideA": {
      "conversation": [
        { "text": "The phrase 'to come up' is used in a bug report: 'item does not come up'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_143_a.mp3" },
        { "text": "It means 'to appear' or 'to be displayed'. So, the item is not appearing in the search results.", "audioSrc": "public/data/audio/technical_project_plan/tpp_143_b.mp3" }
      ]
    },
    "note": "'to come up' (Phrasal Verb) means to appear or be displayed, especially in a list or search result."
  },
  {
    "cardId": "tpp_144",
    "sideA": {
      "conversation": [
        { "text": "The user is from Alberta but is being charged Quebec sales tax.", "audioSrc": "public/data/audio/technical_project_plan/tpp_144_a.mp3" },
        { "text": "The location detection logic is failing. The system should apply taxes based on the user's province.", "audioSrc": "public/data/audio/technical_project_plan/tpp_144_b.mp3" }
      ]
    },
    "note": "'Alberta' (AB) (Noun) is a province in Canada.\n\n'Quebec' (QC) (Noun) is a province in Canada.\n\n'Province' (Noun) is a major administrative division of a country, like a state."
  },
  {
    "cardId": "tpp_145",
    "sideA": {
      "conversation": [
        { "text": "What does the 'coming up as' phrase mean in this ticket?", "audioSrc": "public/data/audio/technical_project_plan/tpp_145_a.mp3" },
        { "text": "It means the system is incorrectly displaying one value instead of another. For example, showing 'Breakage' instead of 'Defective Keg'.", "audioSrc": "public/data/audio/technical_project_plan/tpp_145_b.mp3" }
      ]
    },
    "note": "'coming up as' (Phrasal Verb) means 'to appear as' or 'to be displayed as', often highlighting a discrepancy or error."
  },
  {
    "cardId": "tpp_146",
    "sideA": {
      "conversation": [
        { "text": "The tax rate for Saskatchewan needs to be updated.", "audioSrc": "public/data/audio/technical_project_plan/tpp_146_a.mp3" },
        { "text": "I'll update the 'Rate' for SK in the tax configuration table. This will fix the 'Taxes doesn't match value' bug.", "audioSrc": "public/data/audio/technical_project_plan/tpp_146_b.mp3" }
      ]
    },
    "note": "'Saskatchewan' (SK) (Noun) is a province in Canada.\n\n'Rate' (Noun) is the percentage value used for calculations, such as for taxes."
  },
  {
    "cardId": "tpp_147",
    "sideA": {
      "conversation": [
        { "text": "Let's change the UOM from 'Ea' to 'Can' for this product.", "audioSrc": "public/data/audio/technical_project_plan/tpp_147_a.mp3" },
        { "text": "Good idea. 'Can' is more descriptive for the shipping format. I'll update the product data.", "audioSrc": "public/data/audio/technical_project_plan/tpp_147_b.mp3" }
      ]
    },
    "note": "'UOM' (Unit of Measure) (Noun) is the standard unit by which a product is sold.\n\n'Can' (Noun) is a specific unit representing a single metal can container."
  },
  {
    "cardId": "tpp_148",
    "sideA": {
      "conversation": [
        { "text": "We need to handle the 'Keg Broken Seal' case in our returns logic.", "audioSrc": "public/data/audio/technical_project_plan/tpp_148_a.mp3" },
        { "text": "Agreed. This should trigger a quality alert and prevent the item from being restocked.", "audioSrc": "public/data/audio/technical_project_plan/tpp_148_b.mp3" }
      ]
    },
    "note": "'Keg Broken Seal' (Noun Phrase) is a specific reason for returning a keg, indicating its seal was damaged."
  },
  {
    "cardId": "tpp_149",
    "sideA": {
      "conversation": [
        { "text": "The 'Select' button is not working on the 'Return Items' page.", "audioSrc": "public/data/audio/technical_project_plan/tpp_149_a.mp3" },
        { "text": "The Javascript event handler for the click is probably not attached correctly. I'll take a look.", "audioSrc": "public/data/audio/technical_project_plan/tpp_149_b.mp3" }
      ]
    },
    "note": "'Select' (Verb) is the action of choosing an item from a list.\n\n'Return Items' (Noun Phrase) is the feature or page used for managing product returns."
  },
  {
    "cardId": "tpp_150",
    "sideA": {
      "conversation": [
        { "text": "The PO Number should be a searchable field in the main 'Search' bar.", "audioSrc": "public/data/audio/technical_project_plan/tpp_150_a.mp3" },
        { "text": "Okay, so we're extending the search functionality beyond just CSPC and product name. I'll add it to the backlog.", "audioSrc": "public/data/audio/technical_project_plan/tpp_150_b.mp3" }
      ]
    },
    "note": "'PO Number' (Purchase Order Number) (Noun) is a unique number used to track a specific order.\n\n'Search' (Noun) refers to the application's function for finding data.\n\n'CSPC' (Noun) is a unique code for identifying products."
  }
  ]
}